<?php
include_once('../../../wp-load.php');
require_once('../../../wp-config.php');

global $wpdb; 
$pref_city = array (
  0 => 
  array (
    'id' => '01',
    'pref' => '北海道',
    'city' => 
    array (
      0 => 
      array (
        'id' => '01100',
        'name' => '札幌市',
      ),
      1 => 
      array (
        'id' => '01101',
        'name' => '中央区',
      ),
      2 => 
      array (
        'id' => '01102',
        'name' => '北区',
      ),
      3 => 
      array (
        'id' => '01103',
        'name' => '東区',
      ),
      4 => 
      array (
        'id' => '01104',
        'name' => '白石区',
      ),
      5 => 
      array (
        'id' => '01105',
        'name' => '豊平区',
      ),
      6 => 
      array (
        'id' => '01106',
        'name' => '南区',
      ),
      7 => 
      array (
        'id' => '01107',
        'name' => '西区',
      ),
      8 => 
      array (
        'id' => '01108',
        'name' => '厚別区',
      ),
      9 => 
      array (
        'id' => '01109',
        'name' => '手稲区',
      ),
      10 => 
      array (
        'id' => '01110',
        'name' => '清田区',
      ),
      11 => 
      array (
        'id' => '01202',
        'name' => '函館市',
      ),
      12 => 
      array (
        'id' => '01203',
        'name' => '小樽市',
      ),
      13 => 
      array (
        'id' => '01204',
        'name' => '旭川市',
      ),
      14 => 
      array (
        'id' => '01205',
        'name' => '室蘭市',
      ),
      15 => 
      array (
        'id' => '01206',
        'name' => '釧路市',
      ),
      16 => 
      array (
        'id' => '01207',
        'name' => '帯広市',
      ),
      17 => 
      array (
        'id' => '01208',
        'name' => '北見市',
      ),
      18 => 
      array (
        'id' => '01209',
        'name' => '夕張市',
      ),
      19 => 
      array (
        'id' => '01210',
        'name' => '岩見沢市',
      ),
      20 => 
      array (
        'id' => '01211',
        'name' => '網走市',
      ),
      21 => 
      array (
        'id' => '01212',
        'name' => '留萌市',
      ),
      22 => 
      array (
        'id' => '01213',
        'name' => '苫小牧市',
      ),
      23 => 
      array (
        'id' => '01214',
        'name' => '稚内市',
      ),
      24 => 
      array (
        'id' => '01215',
        'name' => '美唄市',
      ),
      25 => 
      array (
        'id' => '01216',
        'name' => '芦別市',
      ),
      26 => 
      array (
        'id' => '01217',
        'name' => '江別市',
      ),
      27 => 
      array (
        'id' => '01218',
        'name' => '赤平市',
      ),
      28 => 
      array (
        'id' => '01219',
        'name' => '紋別市',
      ),
      29 => 
      array (
        'id' => '01220',
        'name' => '士別市',
      ),
      30 => 
      array (
        'id' => '01221',
        'name' => '名寄市',
      ),
      31 => 
      array (
        'id' => '01222',
        'name' => '三笠市',
      ),
      32 => 
      array (
        'id' => '01223',
        'name' => '根室市',
      ),
      33 => 
      array (
        'id' => '01224',
        'name' => '千歳市',
      ),
      34 => 
      array (
        'id' => '01225',
        'name' => '滝川市',
      ),
      35 => 
      array (
        'id' => '01226',
        'name' => '砂川市',
      ),
      36 => 
      array (
        'id' => '01227',
        'name' => '歌志内市',
      ),
      37 => 
      array (
        'id' => '01228',
        'name' => '深川市',
      ),
      38 => 
      array (
        'id' => '01229',
        'name' => '富良野市',
      ),
      39 => 
      array (
        'id' => '01230',
        'name' => '登別市',
      ),
      40 => 
      array (
        'id' => '01231',
        'name' => '恵庭市',
      ),
      41 => 
      array (
        'id' => '01233',
        'name' => '伊達市',
      ),
      42 => 
      array (
        'id' => '01234',
        'name' => '北広島市',
      ),
      43 => 
      array (
        'id' => '01235',
        'name' => '石狩市',
      ),
      44 => 
      array (
        'id' => '01236',
        'name' => '北斗市',
      ),
      45 => 
      array (
        'id' => '01303',
        'name' => '当別町',
      ),
      46 => 
      array (
        'id' => '01304',
        'name' => '新篠津村',
      ),
      47 => 
      array (
        'id' => '01331',
        'name' => '松前町',
      ),
      48 => 
      array (
        'id' => '01332',
        'name' => '福島町',
      ),
      49 => 
      array (
        'id' => '01333',
        'name' => '知内町',
      ),
      50 => 
      array (
        'id' => '01334',
        'name' => '木古内町',
      ),
      51 => 
      array (
        'id' => '01337',
        'name' => '七飯町',
      ),
      52 => 
      array (
        'id' => '01343',
        'name' => '鹿部町',
      ),
      53 => 
      array (
        'id' => '01345',
        'name' => '森町',
      ),
      54 => 
      array (
        'id' => '01346',
        'name' => '八雲町',
      ),
      55 => 
      array (
        'id' => '01347',
        'name' => '長万部町',
      ),
      56 => 
      array (
        'id' => '01361',
        'name' => '江差町',
      ),
      57 => 
      array (
        'id' => '01362',
        'name' => '上ノ国町',
      ),
      58 => 
      array (
        'id' => '01363',
        'name' => '厚沢部町',
      ),
      59 => 
      array (
        'id' => '01364',
        'name' => '乙部町',
      ),
      60 => 
      array (
        'id' => '01367',
        'name' => '奥尻町',
      ),
      61 => 
      array (
        'id' => '01370',
        'name' => '今金町',
      ),
      62 => 
      array (
        'id' => '01371',
        'name' => 'せたな町',
      ),
      63 => 
      array (
        'id' => '01391',
        'name' => '島牧村',
      ),
      64 => 
      array (
        'id' => '01392',
        'name' => '寿都町',
      ),
      65 => 
      array (
        'id' => '01393',
        'name' => '黒松内町',
      ),
      66 => 
      array (
        'id' => '01394',
        'name' => '蘭越町',
      ),
      67 => 
      array (
        'id' => '01395',
        'name' => 'ニセコ町',
      ),
      68 => 
      array (
        'id' => '01396',
        'name' => '真狩村',
      ),
      69 => 
      array (
        'id' => '01397',
        'name' => '留寿都村',
      ),
      70 => 
      array (
        'id' => '01398',
        'name' => '喜茂別町',
      ),
      71 => 
      array (
        'id' => '01399',
        'name' => '京極町',
      ),
      72 => 
      array (
        'id' => '01400',
        'name' => '倶知安町',
      ),
      73 => 
      array (
        'id' => '01401',
        'name' => '共和町',
      ),
      74 => 
      array (
        'id' => '01402',
        'name' => '岩内町',
      ),
      75 => 
      array (
        'id' => '01403',
        'name' => '泊村',
      ),
      76 => 
      array (
        'id' => '01404',
        'name' => '神恵内村',
      ),
      77 => 
      array (
        'id' => '01405',
        'name' => '積丹町',
      ),
      78 => 
      array (
        'id' => '01406',
        'name' => '古平町',
      ),
      79 => 
      array (
        'id' => '01407',
        'name' => '仁木町',
      ),
      80 => 
      array (
        'id' => '01408',
        'name' => '余市町',
      ),
      81 => 
      array (
        'id' => '01409',
        'name' => '赤井川村',
      ),
      82 => 
      array (
        'id' => '01423',
        'name' => '南幌町',
      ),
      83 => 
      array (
        'id' => '01424',
        'name' => '奈井江町',
      ),
      84 => 
      array (
        'id' => '01425',
        'name' => '上砂川町',
      ),
      85 => 
      array (
        'id' => '01427',
        'name' => '由仁町',
      ),
      86 => 
      array (
        'id' => '01428',
        'name' => '長沼町',
      ),
      87 => 
      array (
        'id' => '01429',
        'name' => '栗山町',
      ),
      88 => 
      array (
        'id' => '01430',
        'name' => '月形町',
      ),
      89 => 
      array (
        'id' => '01431',
        'name' => '浦臼町',
      ),
      90 => 
      array (
        'id' => '01432',
        'name' => '新十津川町',
      ),
      91 => 
      array (
        'id' => '01433',
        'name' => '妹背牛町',
      ),
      92 => 
      array (
        'id' => '01434',
        'name' => '秩父別町',
      ),
      93 => 
      array (
        'id' => '01436',
        'name' => '雨竜町',
      ),
      94 => 
      array (
        'id' => '01437',
        'name' => '北竜町',
      ),
      95 => 
      array (
        'id' => '01438',
        'name' => '沼田町',
      ),
      96 => 
      array (
        'id' => '01452',
        'name' => '鷹栖町',
      ),
      97 => 
      array (
        'id' => '01453',
        'name' => '東神楽町',
      ),
      98 => 
      array (
        'id' => '01454',
        'name' => '当麻町',
      ),
      99 => 
      array (
        'id' => '01455',
        'name' => '比布町',
      ),
      100 => 
      array (
        'id' => '01456',
        'name' => '愛別町',
      ),
      101 => 
      array (
        'id' => '01457',
        'name' => '上川町',
      ),
      102 => 
      array (
        'id' => '01458',
        'name' => '東川町',
      ),
      103 => 
      array (
        'id' => '01459',
        'name' => '美瑛町',
      ),
      104 => 
      array (
        'id' => '01460',
        'name' => '上富良野町',
      ),
      105 => 
      array (
        'id' => '01461',
        'name' => '中富良野町',
      ),
      106 => 
      array (
        'id' => '01462',
        'name' => '南富良野町',
      ),
      107 => 
      array (
        'id' => '01463',
        'name' => '占冠村',
      ),
      108 => 
      array (
        'id' => '01464',
        'name' => '和寒町',
      ),
      109 => 
      array (
        'id' => '01465',
        'name' => '剣淵町',
      ),
      110 => 
      array (
        'id' => '01468',
        'name' => '下川町',
      ),
      111 => 
      array (
        'id' => '01469',
        'name' => '美深町',
      ),
      112 => 
      array (
        'id' => '01470',
        'name' => '音威子府村',
      ),
      113 => 
      array (
        'id' => '01471',
        'name' => '中川町',
      ),
      114 => 
      array (
        'id' => '01472',
        'name' => '幌加内町',
      ),
      115 => 
      array (
        'id' => '01481',
        'name' => '増毛町',
      ),
      116 => 
      array (
        'id' => '01482',
        'name' => '小平町',
      ),
      117 => 
      array (
        'id' => '01483',
        'name' => '苫前町',
      ),
      118 => 
      array (
        'id' => '01484',
        'name' => '羽幌町',
      ),
      119 => 
      array (
        'id' => '01485',
        'name' => '初山別村',
      ),
      120 => 
      array (
        'id' => '01486',
        'name' => '遠別町',
      ),
      121 => 
      array (
        'id' => '01487',
        'name' => '天塩町',
      ),
      122 => 
      array (
        'id' => '01511',
        'name' => '猿払村',
      ),
      123 => 
      array (
        'id' => '01512',
        'name' => '浜頓別町',
      ),
      124 => 
      array (
        'id' => '01513',
        'name' => '中頓別町',
      ),
      125 => 
      array (
        'id' => '01514',
        'name' => '枝幸町',
      ),
      126 => 
      array (
        'id' => '01516',
        'name' => '豊富町',
      ),
      127 => 
      array (
        'id' => '01517',
        'name' => '礼文町',
      ),
      128 => 
      array (
        'id' => '01518',
        'name' => '利尻町',
      ),
      129 => 
      array (
        'id' => '01519',
        'name' => '利尻富士町',
      ),
      130 => 
      array (
        'id' => '01520',
        'name' => '幌延町',
      ),
      131 => 
      array (
        'id' => '01543',
        'name' => '美幌町',
      ),
      132 => 
      array (
        'id' => '01544',
        'name' => '津別町',
      ),
      133 => 
      array (
        'id' => '01545',
        'name' => '斜里町',
      ),
      134 => 
      array (
        'id' => '01546',
        'name' => '清里町',
      ),
      135 => 
      array (
        'id' => '01547',
        'name' => '小清水町',
      ),
      136 => 
      array (
        'id' => '01549',
        'name' => '訓子府町',
      ),
      137 => 
      array (
        'id' => '01550',
        'name' => '置戸町',
      ),
      138 => 
      array (
        'id' => '01552',
        'name' => '佐呂間町',
      ),
      139 => 
      array (
        'id' => '01555',
        'name' => '遠軽町',
      ),
      140 => 
      array (
        'id' => '01559',
        'name' => '湧別町',
      ),
      141 => 
      array (
        'id' => '01560',
        'name' => '滝上町',
      ),
      142 => 
      array (
        'id' => '01561',
        'name' => '興部町',
      ),
      143 => 
      array (
        'id' => '01562',
        'name' => '西興部村',
      ),
      144 => 
      array (
        'id' => '01563',
        'name' => '雄武町',
      ),
      145 => 
      array (
        'id' => '01564',
        'name' => '大空町',
      ),
      146 => 
      array (
        'id' => '01571',
        'name' => '豊浦町',
      ),
      147 => 
      array (
        'id' => '01575',
        'name' => '壮瞥町',
      ),
      148 => 
      array (
        'id' => '01578',
        'name' => '白老町',
      ),
      149 => 
      array (
        'id' => '01581',
        'name' => '厚真町',
      ),
      150 => 
      array (
        'id' => '01584',
        'name' => '洞爺湖町',
      ),
      151 => 
      array (
        'id' => '01585',
        'name' => '安平町',
      ),
      152 => 
      array (
        'id' => '01586',
        'name' => 'むかわ町',
      ),
      153 => 
      array (
        'id' => '01601',
        'name' => '日高町',
      ),
      154 => 
      array (
        'id' => '01602',
        'name' => '平取町',
      ),
      155 => 
      array (
        'id' => '01604',
        'name' => '新冠町',
      ),
      156 => 
      array (
        'id' => '01607',
        'name' => '浦河町',
      ),
      157 => 
      array (
        'id' => '01608',
        'name' => '様似町',
      ),
      158 => 
      array (
        'id' => '01609',
        'name' => 'えりも町',
      ),
      159 => 
      array (
        'id' => '01610',
        'name' => '新ひだか町',
      ),
      160 => 
      array (
        'id' => '01631',
        'name' => '音更町',
      ),
      161 => 
      array (
        'id' => '01632',
        'name' => '士幌町',
      ),
      162 => 
      array (
        'id' => '01633',
        'name' => '上士幌町',
      ),
      163 => 
      array (
        'id' => '01634',
        'name' => '鹿追町',
      ),
      164 => 
      array (
        'id' => '01635',
        'name' => '新得町',
      ),
      165 => 
      array (
        'id' => '01636',
        'name' => '清水町',
      ),
      166 => 
      array (
        'id' => '01637',
        'name' => '芽室町',
      ),
      167 => 
      array (
        'id' => '01638',
        'name' => '中札内村',
      ),
      168 => 
      array (
        'id' => '01639',
        'name' => '更別村',
      ),
      169 => 
      array (
        'id' => '01641',
        'name' => '大樹町',
      ),
      170 => 
      array (
        'id' => '01642',
        'name' => '広尾町',
      ),
      171 => 
      array (
        'id' => '01643',
        'name' => '幕別町',
      ),
      172 => 
      array (
        'id' => '01644',
        'name' => '池田町',
      ),
      173 => 
      array (
        'id' => '01645',
        'name' => '豊頃町',
      ),
      174 => 
      array (
        'id' => '01646',
        'name' => '本別町',
      ),
      175 => 
      array (
        'id' => '01647',
        'name' => '足寄町',
      ),
      176 => 
      array (
        'id' => '01648',
        'name' => '陸別町',
      ),
      177 => 
      array (
        'id' => '01649',
        'name' => '浦幌町',
      ),
      178 => 
      array (
        'id' => '01661',
        'name' => '釧路町',
      ),
      179 => 
      array (
        'id' => '01662',
        'name' => '厚岸町',
      ),
      180 => 
      array (
        'id' => '01663',
        'name' => '浜中町',
      ),
      181 => 
      array (
        'id' => '01664',
        'name' => '標茶町',
      ),
      182 => 
      array (
        'id' => '01665',
        'name' => '弟子屈町',
      ),
      183 => 
      array (
        'id' => '01667',
        'name' => '鶴居村',
      ),
      184 => 
      array (
        'id' => '01668',
        'name' => '白糠町',
      ),
      185 => 
      array (
        'id' => '01691',
        'name' => '別海町',
      ),
      186 => 
      array (
        'id' => '01692',
        'name' => '中標津町',
      ),
      187 => 
      array (
        'id' => '01693',
        'name' => '標津町',
      ),
      188 => 
      array (
        'id' => '01694',
        'name' => '羅臼町',
      ),
      189 => 
      array (
        'id' => '01695',
        'name' => '色丹村',
      ),
      190 => 
      array (
        'id' => '01696',
        'name' => '泊村',
      ),
      191 => 
      array (
        'id' => '01697',
        'name' => '留夜別村',
      ),
      192 => 
      array (
        'id' => '01698',
        'name' => '留別村',
      ),
      193 => 
      array (
        'id' => '01699',
        'name' => '紗那村',
      ),
      194 => 
      array (
        'id' => '01700',
        'name' => '蘂取村',
      ),
    ),
  ),
  1 => 
  array (
    'id' => '02',
    'pref' => '青森県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '02201',
        'name' => '青森市',
      ),
      1 => 
      array (
        'id' => '02202',
        'name' => '弘前市',
      ),
      2 => 
      array (
        'id' => '02203',
        'name' => '八戸市',
      ),
      3 => 
      array (
        'id' => '02204',
        'name' => '黒石市',
      ),
      4 => 
      array (
        'id' => '02205',
        'name' => '五所川原市',
      ),
      5 => 
      array (
        'id' => '02206',
        'name' => '十和田市',
      ),
      6 => 
      array (
        'id' => '02207',
        'name' => '三沢市',
      ),
      7 => 
      array (
        'id' => '02208',
        'name' => 'むつ市',
      ),
      8 => 
      array (
        'id' => '02209',
        'name' => 'つがる市',
      ),
      9 => 
      array (
        'id' => '02210',
        'name' => '平川市',
      ),
      10 => 
      array (
        'id' => '02301',
        'name' => '平内町',
      ),
      11 => 
      array (
        'id' => '02303',
        'name' => '今別町',
      ),
      12 => 
      array (
        'id' => '02304',
        'name' => '蓬田村',
      ),
      13 => 
      array (
        'id' => '02307',
        'name' => '外ヶ浜町',
      ),
      14 => 
      array (
        'id' => '02321',
        'name' => '鰺ヶ沢町',
      ),
      15 => 
      array (
        'id' => '02323',
        'name' => '深浦町',
      ),
      16 => 
      array (
        'id' => '02343',
        'name' => '西目屋村',
      ),
      17 => 
      array (
        'id' => '02361',
        'name' => '藤崎町',
      ),
      18 => 
      array (
        'id' => '02362',
        'name' => '大鰐町',
      ),
      19 => 
      array (
        'id' => '02367',
        'name' => '田舎館村',
      ),
      20 => 
      array (
        'id' => '02381',
        'name' => '板柳町',
      ),
      21 => 
      array (
        'id' => '02384',
        'name' => '鶴田町',
      ),
      22 => 
      array (
        'id' => '02387',
        'name' => '中泊町',
      ),
      23 => 
      array (
        'id' => '02401',
        'name' => '野辺地町',
      ),
      24 => 
      array (
        'id' => '02402',
        'name' => '七戸町',
      ),
      25 => 
      array (
        'id' => '02405',
        'name' => '六戸町',
      ),
      26 => 
      array (
        'id' => '02406',
        'name' => '横浜町',
      ),
      27 => 
      array (
        'id' => '02408',
        'name' => '東北町',
      ),
      28 => 
      array (
        'id' => '02411',
        'name' => '六ヶ所村',
      ),
      29 => 
      array (
        'id' => '02412',
        'name' => 'おいらせ町',
      ),
      30 => 
      array (
        'id' => '02423',
        'name' => '大間町',
      ),
      31 => 
      array (
        'id' => '02424',
        'name' => '東通村',
      ),
      32 => 
      array (
        'id' => '02425',
        'name' => '風間浦村',
      ),
      33 => 
      array (
        'id' => '02426',
        'name' => '佐井村',
      ),
      34 => 
      array (
        'id' => '02441',
        'name' => '三戸町',
      ),
      35 => 
      array (
        'id' => '02442',
        'name' => '五戸町',
      ),
      36 => 
      array (
        'id' => '02443',
        'name' => '田子町',
      ),
      37 => 
      array (
        'id' => '02445',
        'name' => '南部町',
      ),
      38 => 
      array (
        'id' => '02446',
        'name' => '階上町',
      ),
      39 => 
      array (
        'id' => '02450',
        'name' => '新郷村',
      ),
    ),
  ),
  2 => 
  array (
    'id' => '03',
    'pref' => '岩手県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '03201',
        'name' => '盛岡市',
      ),
      1 => 
      array (
        'id' => '03202',
        'name' => '宮古市',
      ),
      2 => 
      array (
        'id' => '03203',
        'name' => '大船渡市',
      ),
      3 => 
      array (
        'id' => '03205',
        'name' => '花巻市',
      ),
      4 => 
      array (
        'id' => '03206',
        'name' => '北上市',
      ),
      5 => 
      array (
        'id' => '03207',
        'name' => '久慈市',
      ),
      6 => 
      array (
        'id' => '03208',
        'name' => '遠野市',
      ),
      7 => 
      array (
        'id' => '03209',
        'name' => '一関市',
      ),
      8 => 
      array (
        'id' => '03210',
        'name' => '陸前高田市',
      ),
      9 => 
      array (
        'id' => '03211',
        'name' => '釜石市',
      ),
      10 => 
      array (
        'id' => '03213',
        'name' => '二戸市',
      ),
      11 => 
      array (
        'id' => '03214',
        'name' => '八幡平市',
      ),
      12 => 
      array (
        'id' => '03215',
        'name' => '奥州市',
      ),
      13 => 
      array (
        'id' => '03216',
        'name' => '滝沢市',
      ),
      14 => 
      array (
        'id' => '03301',
        'name' => '雫石町',
      ),
      15 => 
      array (
        'id' => '03302',
        'name' => '葛巻町',
      ),
      16 => 
      array (
        'id' => '03303',
        'name' => '岩手町',
      ),
      17 => 
      array (
        'id' => '03321',
        'name' => '紫波町',
      ),
      18 => 
      array (
        'id' => '03322',
        'name' => '矢巾町',
      ),
      19 => 
      array (
        'id' => '03366',
        'name' => '西和賀町',
      ),
      20 => 
      array (
        'id' => '03381',
        'name' => '金ケ崎町',
      ),
      21 => 
      array (
        'id' => '03402',
        'name' => '平泉町',
      ),
      22 => 
      array (
        'id' => '03441',
        'name' => '住田町',
      ),
      23 => 
      array (
        'id' => '03461',
        'name' => '大槌町',
      ),
      24 => 
      array (
        'id' => '03482',
        'name' => '山田町',
      ),
      25 => 
      array (
        'id' => '03483',
        'name' => '岩泉町',
      ),
      26 => 
      array (
        'id' => '03484',
        'name' => '田野畑村',
      ),
      27 => 
      array (
        'id' => '03485',
        'name' => '普代村',
      ),
      28 => 
      array (
        'id' => '03501',
        'name' => '軽米町',
      ),
      29 => 
      array (
        'id' => '03503',
        'name' => '野田村',
      ),
      30 => 
      array (
        'id' => '03506',
        'name' => '九戸村',
      ),
      31 => 
      array (
        'id' => '03507',
        'name' => '洋野町',
      ),
      32 => 
      array (
        'id' => '03524',
        'name' => '一戸町',
      ),
    ),
  ),
  3 => 
  array (
    'id' => '04',
    'pref' => '宮城県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '04100',
        'name' => '仙台市',
      ),
      1 => 
      array (
        'id' => '04101',
        'name' => '青葉区',
      ),
      2 => 
      array (
        'id' => '04102',
        'name' => '宮城野区',
      ),
      3 => 
      array (
        'id' => '04103',
        'name' => '若林区',
      ),
      4 => 
      array (
        'id' => '04104',
        'name' => '太白区',
      ),
      5 => 
      array (
        'id' => '04105',
        'name' => '泉区',
      ),
      6 => 
      array (
        'id' => '04202',
        'name' => '石巻市',
      ),
      7 => 
      array (
        'id' => '04203',
        'name' => '塩竈市',
      ),
      8 => 
      array (
        'id' => '04205',
        'name' => '気仙沼市',
      ),
      9 => 
      array (
        'id' => '04206',
        'name' => '白石市',
      ),
      10 => 
      array (
        'id' => '04207',
        'name' => '名取市',
      ),
      11 => 
      array (
        'id' => '04208',
        'name' => '角田市',
      ),
      12 => 
      array (
        'id' => '04209',
        'name' => '多賀城市',
      ),
      13 => 
      array (
        'id' => '04211',
        'name' => '岩沼市',
      ),
      14 => 
      array (
        'id' => '04212',
        'name' => '登米市',
      ),
      15 => 
      array (
        'id' => '04213',
        'name' => '栗原市',
      ),
      16 => 
      array (
        'id' => '04214',
        'name' => '東松島市',
      ),
      17 => 
      array (
        'id' => '04215',
        'name' => '大崎市',
      ),
      18 => 
      array (
        'id' => '04216',
        'name' => '富谷市',
      ),
      19 => 
      array (
        'id' => '04301',
        'name' => '蔵王町',
      ),
      20 => 
      array (
        'id' => '04302',
        'name' => '七ヶ宿町',
      ),
      21 => 
      array (
        'id' => '04321',
        'name' => '大河原町',
      ),
      22 => 
      array (
        'id' => '04322',
        'name' => '村田町',
      ),
      23 => 
      array (
        'id' => '04323',
        'name' => '柴田町',
      ),
      24 => 
      array (
        'id' => '04324',
        'name' => '川崎町',
      ),
      25 => 
      array (
        'id' => '04341',
        'name' => '丸森町',
      ),
      26 => 
      array (
        'id' => '04361',
        'name' => '亘理町',
      ),
      27 => 
      array (
        'id' => '04362',
        'name' => '山元町',
      ),
      28 => 
      array (
        'id' => '04401',
        'name' => '松島町',
      ),
      29 => 
      array (
        'id' => '04404',
        'name' => '七ヶ浜町',
      ),
      30 => 
      array (
        'id' => '04406',
        'name' => '利府町',
      ),
      31 => 
      array (
        'id' => '04421',
        'name' => '大和町',
      ),
      32 => 
      array (
        'id' => '04422',
        'name' => '大郷町',
      ),
      33 => 
      array (
        'id' => '04424',
        'name' => '大衡村',
      ),
      34 => 
      array (
        'id' => '04444',
        'name' => '色麻町',
      ),
      35 => 
      array (
        'id' => '04445',
        'name' => '加美町',
      ),
      36 => 
      array (
        'id' => '04501',
        'name' => '涌谷町',
      ),
      37 => 
      array (
        'id' => '04505',
        'name' => '美里町',
      ),
      38 => 
      array (
        'id' => '04581',
        'name' => '女川町',
      ),
      39 => 
      array (
        'id' => '04606',
        'name' => '南三陸町',
      ),
    ),
  ),
  4 => 
  array (
    'id' => '05',
    'pref' => '秋田県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '05201',
        'name' => '秋田市',
      ),
      1 => 
      array (
        'id' => '05202',
        'name' => '能代市',
      ),
      2 => 
      array (
        'id' => '05203',
        'name' => '横手市',
      ),
      3 => 
      array (
        'id' => '05204',
        'name' => '大館市',
      ),
      4 => 
      array (
        'id' => '05206',
        'name' => '男鹿市',
      ),
      5 => 
      array (
        'id' => '05207',
        'name' => '湯沢市',
      ),
      6 => 
      array (
        'id' => '05209',
        'name' => '鹿角市',
      ),
      7 => 
      array (
        'id' => '05210',
        'name' => '由利本荘市',
      ),
      8 => 
      array (
        'id' => '05211',
        'name' => '潟上市',
      ),
      9 => 
      array (
        'id' => '05212',
        'name' => '大仙市',
      ),
      10 => 
      array (
        'id' => '05213',
        'name' => '北秋田市',
      ),
      11 => 
      array (
        'id' => '05214',
        'name' => 'にかほ市',
      ),
      12 => 
      array (
        'id' => '05215',
        'name' => '仙北市',
      ),
      13 => 
      array (
        'id' => '05303',
        'name' => '小坂町',
      ),
      14 => 
      array (
        'id' => '05327',
        'name' => '上小阿仁村',
      ),
      15 => 
      array (
        'id' => '05346',
        'name' => '藤里町',
      ),
      16 => 
      array (
        'id' => '05348',
        'name' => '三種町',
      ),
      17 => 
      array (
        'id' => '05349',
        'name' => '八峰町',
      ),
      18 => 
      array (
        'id' => '05361',
        'name' => '五城目町',
      ),
      19 => 
      array (
        'id' => '05363',
        'name' => '八郎潟町',
      ),
      20 => 
      array (
        'id' => '05366',
        'name' => '井川町',
      ),
      21 => 
      array (
        'id' => '05368',
        'name' => '大潟村',
      ),
      22 => 
      array (
        'id' => '05434',
        'name' => '美郷町',
      ),
      23 => 
      array (
        'id' => '05463',
        'name' => '羽後町',
      ),
      24 => 
      array (
        'id' => '05464',
        'name' => '東成瀬村',
      ),
    ),
  ),
  5 => 
  array (
    'id' => '06',
    'pref' => '山形県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '06201',
        'name' => '山形市',
      ),
      1 => 
      array (
        'id' => '06202',
        'name' => '米沢市',
      ),
      2 => 
      array (
        'id' => '06203',
        'name' => '鶴岡市',
      ),
      3 => 
      array (
        'id' => '06204',
        'name' => '酒田市',
      ),
      4 => 
      array (
        'id' => '06205',
        'name' => '新庄市',
      ),
      5 => 
      array (
        'id' => '06206',
        'name' => '寒河江市',
      ),
      6 => 
      array (
        'id' => '06207',
        'name' => '上山市',
      ),
      7 => 
      array (
        'id' => '06208',
        'name' => '村山市',
      ),
      8 => 
      array (
        'id' => '06209',
        'name' => '長井市',
      ),
      9 => 
      array (
        'id' => '06210',
        'name' => '天童市',
      ),
      10 => 
      array (
        'id' => '06211',
        'name' => '東根市',
      ),
      11 => 
      array (
        'id' => '06212',
        'name' => '尾花沢市',
      ),
      12 => 
      array (
        'id' => '06213',
        'name' => '南陽市',
      ),
      13 => 
      array (
        'id' => '06301',
        'name' => '山辺町',
      ),
      14 => 
      array (
        'id' => '06302',
        'name' => '中山町',
      ),
      15 => 
      array (
        'id' => '06321',
        'name' => '河北町',
      ),
      16 => 
      array (
        'id' => '06322',
        'name' => '西川町',
      ),
      17 => 
      array (
        'id' => '06323',
        'name' => '朝日町',
      ),
      18 => 
      array (
        'id' => '06324',
        'name' => '大江町',
      ),
      19 => 
      array (
        'id' => '06341',
        'name' => '大石田町',
      ),
      20 => 
      array (
        'id' => '06361',
        'name' => '金山町',
      ),
      21 => 
      array (
        'id' => '06362',
        'name' => '最上町',
      ),
      22 => 
      array (
        'id' => '06363',
        'name' => '舟形町',
      ),
      23 => 
      array (
        'id' => '06364',
        'name' => '真室川町',
      ),
      24 => 
      array (
        'id' => '06365',
        'name' => '大蔵村',
      ),
      25 => 
      array (
        'id' => '06366',
        'name' => '鮭川村',
      ),
      26 => 
      array (
        'id' => '06367',
        'name' => '戸沢村',
      ),
      27 => 
      array (
        'id' => '06381',
        'name' => '高畠町',
      ),
      28 => 
      array (
        'id' => '06382',
        'name' => '川西町',
      ),
      29 => 
      array (
        'id' => '06401',
        'name' => '小国町',
      ),
      30 => 
      array (
        'id' => '06402',
        'name' => '白鷹町',
      ),
      31 => 
      array (
        'id' => '06403',
        'name' => '飯豊町',
      ),
      32 => 
      array (
        'id' => '06426',
        'name' => '三川町',
      ),
      33 => 
      array (
        'id' => '06428',
        'name' => '庄内町',
      ),
      34 => 
      array (
        'id' => '06461',
        'name' => '遊佐町',
      ),
    ),
  ),
  6 => 
  array (
    'id' => '07',
    'pref' => '福島県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '07201',
        'name' => '福島市',
      ),
      1 => 
      array (
        'id' => '07202',
        'name' => '会津若松市',
      ),
      2 => 
      array (
        'id' => '07203',
        'name' => '郡山市',
      ),
      3 => 
      array (
        'id' => '07204',
        'name' => 'いわき市',
      ),
      4 => 
      array (
        'id' => '07205',
        'name' => '白河市',
      ),
      5 => 
      array (
        'id' => '07207',
        'name' => '須賀川市',
      ),
      6 => 
      array (
        'id' => '07208',
        'name' => '喜多方市',
      ),
      7 => 
      array (
        'id' => '07209',
        'name' => '相馬市',
      ),
      8 => 
      array (
        'id' => '07210',
        'name' => '二本松市',
      ),
      9 => 
      array (
        'id' => '07211',
        'name' => '田村市',
      ),
      10 => 
      array (
        'id' => '07212',
        'name' => '南相馬市',
      ),
      11 => 
      array (
        'id' => '07213',
        'name' => '伊達市',
      ),
      12 => 
      array (
        'id' => '07214',
        'name' => '本宮市',
      ),
      13 => 
      array (
        'id' => '07301',
        'name' => '桑折町',
      ),
      14 => 
      array (
        'id' => '07303',
        'name' => '国見町',
      ),
      15 => 
      array (
        'id' => '07308',
        'name' => '川俣町',
      ),
      16 => 
      array (
        'id' => '07322',
        'name' => '大玉村',
      ),
      17 => 
      array (
        'id' => '07342',
        'name' => '鏡石町',
      ),
      18 => 
      array (
        'id' => '07344',
        'name' => '天栄村',
      ),
      19 => 
      array (
        'id' => '07362',
        'name' => '下郷町',
      ),
      20 => 
      array (
        'id' => '07364',
        'name' => '檜枝岐村',
      ),
      21 => 
      array (
        'id' => '07367',
        'name' => '只見町',
      ),
      22 => 
      array (
        'id' => '07368',
        'name' => '南会津町',
      ),
      23 => 
      array (
        'id' => '07402',
        'name' => '北塩原村',
      ),
      24 => 
      array (
        'id' => '07405',
        'name' => '西会津町',
      ),
      25 => 
      array (
        'id' => '07407',
        'name' => '磐梯町',
      ),
      26 => 
      array (
        'id' => '07408',
        'name' => '猪苗代町',
      ),
      27 => 
      array (
        'id' => '07421',
        'name' => '会津坂下町',
      ),
      28 => 
      array (
        'id' => '07422',
        'name' => '湯川村',
      ),
      29 => 
      array (
        'id' => '07423',
        'name' => '柳津町',
      ),
      30 => 
      array (
        'id' => '07444',
        'name' => '三島町',
      ),
      31 => 
      array (
        'id' => '07445',
        'name' => '金山町',
      ),
      32 => 
      array (
        'id' => '07446',
        'name' => '昭和村',
      ),
      33 => 
      array (
        'id' => '07447',
        'name' => '会津美里町',
      ),
      34 => 
      array (
        'id' => '07461',
        'name' => '西郷村',
      ),
      35 => 
      array (
        'id' => '07464',
        'name' => '泉崎村',
      ),
      36 => 
      array (
        'id' => '07465',
        'name' => '中島村',
      ),
      37 => 
      array (
        'id' => '07466',
        'name' => '矢吹町',
      ),
      38 => 
      array (
        'id' => '07481',
        'name' => '棚倉町',
      ),
      39 => 
      array (
        'id' => '07482',
        'name' => '矢祭町',
      ),
      40 => 
      array (
        'id' => '07483',
        'name' => '塙町',
      ),
      41 => 
      array (
        'id' => '07484',
        'name' => '鮫川村',
      ),
      42 => 
      array (
        'id' => '07501',
        'name' => '石川町',
      ),
      43 => 
      array (
        'id' => '07502',
        'name' => '玉川村',
      ),
      44 => 
      array (
        'id' => '07503',
        'name' => '平田村',
      ),
      45 => 
      array (
        'id' => '07504',
        'name' => '浅川町',
      ),
      46 => 
      array (
        'id' => '07505',
        'name' => '古殿町',
      ),
      47 => 
      array (
        'id' => '07521',
        'name' => '三春町',
      ),
      48 => 
      array (
        'id' => '07522',
        'name' => '小野町',
      ),
      49 => 
      array (
        'id' => '07541',
        'name' => '広野町',
      ),
      50 => 
      array (
        'id' => '07542',
        'name' => '楢葉町',
      ),
      51 => 
      array (
        'id' => '07543',
        'name' => '富岡町',
      ),
      52 => 
      array (
        'id' => '07544',
        'name' => '川内村',
      ),
      53 => 
      array (
        'id' => '07545',
        'name' => '大熊町',
      ),
      54 => 
      array (
        'id' => '07546',
        'name' => '双葉町',
      ),
      55 => 
      array (
        'id' => '07547',
        'name' => '浪江町',
      ),
      56 => 
      array (
        'id' => '07548',
        'name' => '葛尾村',
      ),
      57 => 
      array (
        'id' => '07561',
        'name' => '新地町',
      ),
      58 => 
      array (
        'id' => '07564',
        'name' => '飯舘村',
      ),
    ),
  ),
  7 => 
  array (
    'id' => '08',
    'pref' => '茨城県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '08201',
        'name' => '水戸市',
      ),
      1 => 
      array (
        'id' => '08202',
        'name' => '日立市',
      ),
      2 => 
      array (
        'id' => '08203',
        'name' => '土浦市',
      ),
      3 => 
      array (
        'id' => '08204',
        'name' => '古河市',
      ),
      4 => 
      array (
        'id' => '08205',
        'name' => '石岡市',
      ),
      5 => 
      array (
        'id' => '08207',
        'name' => '結城市',
      ),
      6 => 
      array (
        'id' => '08208',
        'name' => '龍ケ崎市',
      ),
      7 => 
      array (
        'id' => '08210',
        'name' => '下妻市',
      ),
      8 => 
      array (
        'id' => '08211',
        'name' => '常総市',
      ),
      9 => 
      array (
        'id' => '08212',
        'name' => '常陸太田市',
      ),
      10 => 
      array (
        'id' => '08214',
        'name' => '高萩市',
      ),
      11 => 
      array (
        'id' => '08215',
        'name' => '北茨城市',
      ),
      12 => 
      array (
        'id' => '08216',
        'name' => '笠間市',
      ),
      13 => 
      array (
        'id' => '08217',
        'name' => '取手市',
      ),
      14 => 
      array (
        'id' => '08219',
        'name' => '牛久市',
      ),
      15 => 
      array (
        'id' => '08220',
        'name' => 'つくば市',
      ),
      16 => 
      array (
        'id' => '08221',
        'name' => 'ひたちなか市',
      ),
      17 => 
      array (
        'id' => '08222',
        'name' => '鹿嶋市',
      ),
      18 => 
      array (
        'id' => '08223',
        'name' => '潮来市',
      ),
      19 => 
      array (
        'id' => '08224',
        'name' => '守谷市',
      ),
      20 => 
      array (
        'id' => '08225',
        'name' => '常陸大宮市',
      ),
      21 => 
      array (
        'id' => '08226',
        'name' => '那珂市',
      ),
      22 => 
      array (
        'id' => '08227',
        'name' => '筑西市',
      ),
      23 => 
      array (
        'id' => '08228',
        'name' => '坂東市',
      ),
      24 => 
      array (
        'id' => '08229',
        'name' => '稲敷市',
      ),
      25 => 
      array (
        'id' => '08230',
        'name' => 'かすみがうら市',
      ),
      26 => 
      array (
        'id' => '08231',
        'name' => '桜川市',
      ),
      27 => 
      array (
        'id' => '08232',
        'name' => '神栖市',
      ),
      28 => 
      array (
        'id' => '08233',
        'name' => '行方市',
      ),
      29 => 
      array (
        'id' => '08234',
        'name' => '鉾田市',
      ),
      30 => 
      array (
        'id' => '08235',
        'name' => 'つくばみらい市',
      ),
      31 => 
      array (
        'id' => '08236',
        'name' => '小美玉市',
      ),
      32 => 
      array (
        'id' => '08302',
        'name' => '茨城町',
      ),
      33 => 
      array (
        'id' => '08309',
        'name' => '大洗町',
      ),
      34 => 
      array (
        'id' => '08310',
        'name' => '城里町',
      ),
      35 => 
      array (
        'id' => '08341',
        'name' => '東海村',
      ),
      36 => 
      array (
        'id' => '08364',
        'name' => '大子町',
      ),
      37 => 
      array (
        'id' => '08442',
        'name' => '美浦村',
      ),
      38 => 
      array (
        'id' => '08443',
        'name' => '阿見町',
      ),
      39 => 
      array (
        'id' => '08447',
        'name' => '河内町',
      ),
      40 => 
      array (
        'id' => '08521',
        'name' => '八千代町',
      ),
      41 => 
      array (
        'id' => '08542',
        'name' => '五霞町',
      ),
      42 => 
      array (
        'id' => '08546',
        'name' => '境町',
      ),
      43 => 
      array (
        'id' => '08564',
        'name' => '利根町',
      ),
    ),
  ),
  8 => 
  array (
    'id' => '09',
    'pref' => '栃木県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '09201',
        'name' => '宇都宮市',
      ),
      1 => 
      array (
        'id' => '09202',
        'name' => '足利市',
      ),
      2 => 
      array (
        'id' => '09203',
        'name' => '栃木市',
      ),
      3 => 
      array (
        'id' => '09204',
        'name' => '佐野市',
      ),
      4 => 
      array (
        'id' => '09205',
        'name' => '鹿沼市',
      ),
      5 => 
      array (
        'id' => '09206',
        'name' => '日光市',
      ),
      6 => 
      array (
        'id' => '09208',
        'name' => '小山市',
      ),
      7 => 
      array (
        'id' => '09209',
        'name' => '真岡市',
      ),
      8 => 
      array (
        'id' => '09210',
        'name' => '大田原市',
      ),
      9 => 
      array (
        'id' => '09211',
        'name' => '矢板市',
      ),
      10 => 
      array (
        'id' => '09213',
        'name' => '那須塩原市',
      ),
      11 => 
      array (
        'id' => '09214',
        'name' => 'さくら市',
      ),
      12 => 
      array (
        'id' => '09215',
        'name' => '那須烏山市',
      ),
      13 => 
      array (
        'id' => '09216',
        'name' => '下野市',
      ),
      14 => 
      array (
        'id' => '09301',
        'name' => '上三川町',
      ),
      15 => 
      array (
        'id' => '09342',
        'name' => '益子町',
      ),
      16 => 
      array (
        'id' => '09343',
        'name' => '茂木町',
      ),
      17 => 
      array (
        'id' => '09344',
        'name' => '市貝町',
      ),
      18 => 
      array (
        'id' => '09345',
        'name' => '芳賀町',
      ),
      19 => 
      array (
        'id' => '09361',
        'name' => '壬生町',
      ),
      20 => 
      array (
        'id' => '09364',
        'name' => '野木町',
      ),
      21 => 
      array (
        'id' => '09384',
        'name' => '塩谷町',
      ),
      22 => 
      array (
        'id' => '09386',
        'name' => '高根沢町',
      ),
      23 => 
      array (
        'id' => '09407',
        'name' => '那須町',
      ),
      24 => 
      array (
        'id' => '09411',
        'name' => '那珂川町',
      ),
    ),
  ),
  9 => 
  array (
    'id' => '10',
    'pref' => '群馬県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '10201',
        'name' => '前橋市',
      ),
      1 => 
      array (
        'id' => '10202',
        'name' => '高崎市',
      ),
      2 => 
      array (
        'id' => '10203',
        'name' => '桐生市',
      ),
      3 => 
      array (
        'id' => '10204',
        'name' => '伊勢崎市',
      ),
      4 => 
      array (
        'id' => '10205',
        'name' => '太田市',
      ),
      5 => 
      array (
        'id' => '10206',
        'name' => '沼田市',
      ),
      6 => 
      array (
        'id' => '10207',
        'name' => '館林市',
      ),
      7 => 
      array (
        'id' => '10208',
        'name' => '渋川市',
      ),
      8 => 
      array (
        'id' => '10209',
        'name' => '藤岡市',
      ),
      9 => 
      array (
        'id' => '10210',
        'name' => '富岡市',
      ),
      10 => 
      array (
        'id' => '10211',
        'name' => '安中市',
      ),
      11 => 
      array (
        'id' => '10212',
        'name' => 'みどり市',
      ),
      12 => 
      array (
        'id' => '10344',
        'name' => '榛東村',
      ),
      13 => 
      array (
        'id' => '10345',
        'name' => '吉岡町',
      ),
      14 => 
      array (
        'id' => '10366',
        'name' => '上野村',
      ),
      15 => 
      array (
        'id' => '10367',
        'name' => '神流町',
      ),
      16 => 
      array (
        'id' => '10382',
        'name' => '下仁田町',
      ),
      17 => 
      array (
        'id' => '10383',
        'name' => '南牧村',
      ),
      18 => 
      array (
        'id' => '10384',
        'name' => '甘楽町',
      ),
      19 => 
      array (
        'id' => '10421',
        'name' => '中之条町',
      ),
      20 => 
      array (
        'id' => '10424',
        'name' => '長野原町',
      ),
      21 => 
      array (
        'id' => '10425',
        'name' => '嬬恋村',
      ),
      22 => 
      array (
        'id' => '10426',
        'name' => '草津町',
      ),
      23 => 
      array (
        'id' => '10428',
        'name' => '高山村',
      ),
      24 => 
      array (
        'id' => '10429',
        'name' => '東吾妻町',
      ),
      25 => 
      array (
        'id' => '10443',
        'name' => '片品村',
      ),
      26 => 
      array (
        'id' => '10444',
        'name' => '川場村',
      ),
      27 => 
      array (
        'id' => '10448',
        'name' => '昭和村',
      ),
      28 => 
      array (
        'id' => '10449',
        'name' => 'みなかみ町',
      ),
      29 => 
      array (
        'id' => '10464',
        'name' => '玉村町',
      ),
      30 => 
      array (
        'id' => '10521',
        'name' => '板倉町',
      ),
      31 => 
      array (
        'id' => '10522',
        'name' => '明和町',
      ),
      32 => 
      array (
        'id' => '10523',
        'name' => '千代田町',
      ),
      33 => 
      array (
        'id' => '10524',
        'name' => '大泉町',
      ),
      34 => 
      array (
        'id' => '10525',
        'name' => '邑楽町',
      ),
    ),
  ),
  10 => 
  array (
    'id' => '11',
    'pref' => '埼玉県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '11100',
        'name' => 'さいたま市',
      ),
      1 => 
      array (
        'id' => '11101',
        'name' => '西区',
      ),
      2 => 
      array (
        'id' => '11102',
        'name' => '北区',
      ),
      3 => 
      array (
        'id' => '11103',
        'name' => '大宮区',
      ),
      4 => 
      array (
        'id' => '11104',
        'name' => '見沼区',
      ),
      5 => 
      array (
        'id' => '11105',
        'name' => '中央区',
      ),
      6 => 
      array (
        'id' => '11106',
        'name' => '桜区',
      ),
      7 => 
      array (
        'id' => '11107',
        'name' => '浦和区',
      ),
      8 => 
      array (
        'id' => '11108',
        'name' => '南区',
      ),
      9 => 
      array (
        'id' => '11109',
        'name' => '緑区',
      ),
      10 => 
      array (
        'id' => '11110',
        'name' => '岩槻区',
      ),
      11 => 
      array (
        'id' => '11201',
        'name' => '川越市',
      ),
      12 => 
      array (
        'id' => '11202',
        'name' => '熊谷市',
      ),
      13 => 
      array (
        'id' => '11203',
        'name' => '川口市',
      ),
      14 => 
      array (
        'id' => '11206',
        'name' => '行田市',
      ),
      15 => 
      array (
        'id' => '11207',
        'name' => '秩父市',
      ),
      16 => 
      array (
        'id' => '11208',
        'name' => '所沢市',
      ),
      17 => 
      array (
        'id' => '11209',
        'name' => '飯能市',
      ),
      18 => 
      array (
        'id' => '11210',
        'name' => '加須市',
      ),
      19 => 
      array (
        'id' => '11211',
        'name' => '本庄市',
      ),
      20 => 
      array (
        'id' => '11212',
        'name' => '東松山市',
      ),
      21 => 
      array (
        'id' => '11214',
        'name' => '春日部市',
      ),
      22 => 
      array (
        'id' => '11215',
        'name' => '狭山市',
      ),
      23 => 
      array (
        'id' => '11216',
        'name' => '羽生市',
      ),
      24 => 
      array (
        'id' => '11217',
        'name' => '鴻巣市',
      ),
      25 => 
      array (
        'id' => '11218',
        'name' => '深谷市',
      ),
      26 => 
      array (
        'id' => '11219',
        'name' => '上尾市',
      ),
      27 => 
      array (
        'id' => '11221',
        'name' => '草加市',
      ),
      28 => 
      array (
        'id' => '11222',
        'name' => '越谷市',
      ),
      29 => 
      array (
        'id' => '11223',
        'name' => '蕨市',
      ),
      30 => 
      array (
        'id' => '11224',
        'name' => '戸田市',
      ),
      31 => 
      array (
        'id' => '11225',
        'name' => '入間市',
      ),
      32 => 
      array (
        'id' => '11227',
        'name' => '朝霞市',
      ),
      33 => 
      array (
        'id' => '11228',
        'name' => '志木市',
      ),
      34 => 
      array (
        'id' => '11229',
        'name' => '和光市',
      ),
      35 => 
      array (
        'id' => '11230',
        'name' => '新座市',
      ),
      36 => 
      array (
        'id' => '11231',
        'name' => '桶川市',
      ),
      37 => 
      array (
        'id' => '11232',
        'name' => '久喜市',
      ),
      38 => 
      array (
        'id' => '11233',
        'name' => '北本市',
      ),
      39 => 
      array (
        'id' => '11234',
        'name' => '八潮市',
      ),
      40 => 
      array (
        'id' => '11235',
        'name' => '富士見市',
      ),
      41 => 
      array (
        'id' => '11237',
        'name' => '三郷市',
      ),
      42 => 
      array (
        'id' => '11238',
        'name' => '蓮田市',
      ),
      43 => 
      array (
        'id' => '11239',
        'name' => '坂戸市',
      ),
      44 => 
      array (
        'id' => '11240',
        'name' => '幸手市',
      ),
      45 => 
      array (
        'id' => '11241',
        'name' => '鶴ケ島市',
      ),
      46 => 
      array (
        'id' => '11242',
        'name' => '日高市',
      ),
      47 => 
      array (
        'id' => '11243',
        'name' => '吉川市',
      ),
      48 => 
      array (
        'id' => '11245',
        'name' => 'ふじみ野市',
      ),
      49 => 
      array (
        'id' => '11246',
        'name' => '白岡市',
      ),
      50 => 
      array (
        'id' => '11301',
        'name' => '伊奈町',
      ),
      51 => 
      array (
        'id' => '11324',
        'name' => '三芳町',
      ),
      52 => 
      array (
        'id' => '11326',
        'name' => '毛呂山町',
      ),
      53 => 
      array (
        'id' => '11327',
        'name' => '越生町',
      ),
      54 => 
      array (
        'id' => '11341',
        'name' => '滑川町',
      ),
      55 => 
      array (
        'id' => '11342',
        'name' => '嵐山町',
      ),
      56 => 
      array (
        'id' => '11343',
        'name' => '小川町',
      ),
      57 => 
      array (
        'id' => '11346',
        'name' => '川島町',
      ),
      58 => 
      array (
        'id' => '11347',
        'name' => '吉見町',
      ),
      59 => 
      array (
        'id' => '11348',
        'name' => '鳩山町',
      ),
      60 => 
      array (
        'id' => '11349',
        'name' => 'ときがわ町',
      ),
      61 => 
      array (
        'id' => '11361',
        'name' => '横瀬町',
      ),
      62 => 
      array (
        'id' => '11362',
        'name' => '皆野町',
      ),
      63 => 
      array (
        'id' => '11363',
        'name' => '長瀞町',
      ),
      64 => 
      array (
        'id' => '11365',
        'name' => '小鹿野町',
      ),
      65 => 
      array (
        'id' => '11369',
        'name' => '東秩父村',
      ),
      66 => 
      array (
        'id' => '11381',
        'name' => '美里町',
      ),
      67 => 
      array (
        'id' => '11383',
        'name' => '神川町',
      ),
      68 => 
      array (
        'id' => '11385',
        'name' => '上里町',
      ),
      69 => 
      array (
        'id' => '11408',
        'name' => '寄居町',
      ),
      70 => 
      array (
        'id' => '11442',
        'name' => '宮代町',
      ),
      71 => 
      array (
        'id' => '11464',
        'name' => '杉戸町',
      ),
      72 => 
      array (
        'id' => '11465',
        'name' => '松伏町',
      ),
    ),
  ),
  11 => 
  array (
    'id' => '12',
    'pref' => '千葉県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '12100',
        'name' => '千葉市',
      ),
      1 => 
      array (
        'id' => '12101',
        'name' => '中央区',
      ),
      2 => 
      array (
        'id' => '12102',
        'name' => '花見川区',
      ),
      3 => 
      array (
        'id' => '12103',
        'name' => '稲毛区',
      ),
      4 => 
      array (
        'id' => '12104',
        'name' => '若葉区',
      ),
      5 => 
      array (
        'id' => '12105',
        'name' => '緑区',
      ),
      6 => 
      array (
        'id' => '12106',
        'name' => '美浜区',
      ),
      7 => 
      array (
        'id' => '12202',
        'name' => '銚子市',
      ),
      8 => 
      array (
        'id' => '12203',
        'name' => '市川市',
      ),
      9 => 
      array (
        'id' => '12204',
        'name' => '船橋市',
      ),
      10 => 
      array (
        'id' => '12205',
        'name' => '館山市',
      ),
      11 => 
      array (
        'id' => '12206',
        'name' => '木更津市',
      ),
      12 => 
      array (
        'id' => '12207',
        'name' => '松戸市',
      ),
      13 => 
      array (
        'id' => '12208',
        'name' => '野田市',
      ),
      14 => 
      array (
        'id' => '12210',
        'name' => '茂原市',
      ),
      15 => 
      array (
        'id' => '12211',
        'name' => '成田市',
      ),
      16 => 
      array (
        'id' => '12212',
        'name' => '佐倉市',
      ),
      17 => 
      array (
        'id' => '12213',
        'name' => '東金市',
      ),
      18 => 
      array (
        'id' => '12215',
        'name' => '旭市',
      ),
      19 => 
      array (
        'id' => '12216',
        'name' => '習志野市',
      ),
      20 => 
      array (
        'id' => '12217',
        'name' => '柏市',
      ),
      21 => 
      array (
        'id' => '12218',
        'name' => '勝浦市',
      ),
      22 => 
      array (
        'id' => '12219',
        'name' => '市原市',
      ),
      23 => 
      array (
        'id' => '12220',
        'name' => '流山市',
      ),
      24 => 
      array (
        'id' => '12221',
        'name' => '八千代市',
      ),
      25 => 
      array (
        'id' => '12222',
        'name' => '我孫子市',
      ),
      26 => 
      array (
        'id' => '12223',
        'name' => '鴨川市',
      ),
      27 => 
      array (
        'id' => '12224',
        'name' => '鎌ケ谷市',
      ),
      28 => 
      array (
        'id' => '12225',
        'name' => '君津市',
      ),
      29 => 
      array (
        'id' => '12226',
        'name' => '富津市',
      ),
      30 => 
      array (
        'id' => '12227',
        'name' => '浦安市',
      ),
      31 => 
      array (
        'id' => '12228',
        'name' => '四街道市',
      ),
      32 => 
      array (
        'id' => '12229',
        'name' => '袖ケ浦市',
      ),
      33 => 
      array (
        'id' => '12230',
        'name' => '八街市',
      ),
      34 => 
      array (
        'id' => '12231',
        'name' => '印西市',
      ),
      35 => 
      array (
        'id' => '12232',
        'name' => '白井市',
      ),
      36 => 
      array (
        'id' => '12233',
        'name' => '富里市',
      ),
      37 => 
      array (
        'id' => '12234',
        'name' => '南房総市',
      ),
      38 => 
      array (
        'id' => '12235',
        'name' => '匝瑳市',
      ),
      39 => 
      array (
        'id' => '12236',
        'name' => '香取市',
      ),
      40 => 
      array (
        'id' => '12237',
        'name' => '山武市',
      ),
      41 => 
      array (
        'id' => '12238',
        'name' => 'いすみ市',
      ),
      42 => 
      array (
        'id' => '12239',
        'name' => '大網白里市',
      ),
      43 => 
      array (
        'id' => '12322',
        'name' => '酒々井町',
      ),
      44 => 
      array (
        'id' => '12329',
        'name' => '栄町',
      ),
      45 => 
      array (
        'id' => '12342',
        'name' => '神崎町',
      ),
      46 => 
      array (
        'id' => '12347',
        'name' => '多古町',
      ),
      47 => 
      array (
        'id' => '12349',
        'name' => '東庄町',
      ),
      48 => 
      array (
        'id' => '12403',
        'name' => '九十九里町',
      ),
      49 => 
      array (
        'id' => '12409',
        'name' => '芝山町',
      ),
      50 => 
      array (
        'id' => '12410',
        'name' => '横芝光町',
      ),
      51 => 
      array (
        'id' => '12421',
        'name' => '一宮町',
      ),
      52 => 
      array (
        'id' => '12422',
        'name' => '睦沢町',
      ),
      53 => 
      array (
        'id' => '12423',
        'name' => '長生村',
      ),
      54 => 
      array (
        'id' => '12424',
        'name' => '白子町',
      ),
      55 => 
      array (
        'id' => '12426',
        'name' => '長柄町',
      ),
      56 => 
      array (
        'id' => '12427',
        'name' => '長南町',
      ),
      57 => 
      array (
        'id' => '12441',
        'name' => '大多喜町',
      ),
      58 => 
      array (
        'id' => '12443',
        'name' => '御宿町',
      ),
      59 => 
      array (
        'id' => '12463',
        'name' => '鋸南町',
      ),
    ),
  ),
  12 => 
  array (
    'id' => '13',
    'pref' => '東京都',
    'city' => 
    array (
      0 => 
      array (
        'id' => '13101',
        'name' => '千代田区',
      ),
      1 => 
      array (
        'id' => '13102',
        'name' => '中央区',
      ),
      2 => 
      array (
        'id' => '13103',
        'name' => '港区',
      ),
      3 => 
      array (
        'id' => '13104',
        'name' => '新宿区',
      ),
      4 => 
      array (
        'id' => '13105',
        'name' => '文京区',
      ),
      5 => 
      array (
        'id' => '13106',
        'name' => '台東区',
      ),
      6 => 
      array (
        'id' => '13107',
        'name' => '墨田区',
      ),
      7 => 
      array (
        'id' => '13108',
        'name' => '江東区',
      ),
      8 => 
      array (
        'id' => '13109',
        'name' => '品川区',
      ),
      9 => 
      array (
        'id' => '13110',
        'name' => '目黒区',
      ),
      10 => 
      array (
        'id' => '13111',
        'name' => '大田区',
      ),
      11 => 
      array (
        'id' => '13112',
        'name' => '世田谷区',
      ),
      12 => 
      array (
        'id' => '13113',
        'name' => '渋谷区',
      ),
      13 => 
      array (
        'id' => '13114',
        'name' => '中野区',
      ),
      14 => 
      array (
        'id' => '13115',
        'name' => '杉並区',
      ),
      15 => 
      array (
        'id' => '13116',
        'name' => '豊島区',
      ),
      16 => 
      array (
        'id' => '13117',
        'name' => '北区',
      ),
      17 => 
      array (
        'id' => '13118',
        'name' => '荒川区',
      ),
      18 => 
      array (
        'id' => '13119',
        'name' => '板橋区',
      ),
      19 => 
      array (
        'id' => '13120',
        'name' => '練馬区',
      ),
      20 => 
      array (
        'id' => '13121',
        'name' => '足立区',
      ),
      21 => 
      array (
        'id' => '13122',
        'name' => '葛飾区',
      ),
      22 => 
      array (
        'id' => '13123',
        'name' => '江戸川区',
      ),
      23 => 
      array (
        'id' => '13201',
        'name' => '八王子市',
      ),
      24 => 
      array (
        'id' => '13202',
        'name' => '立川市',
      ),
      25 => 
      array (
        'id' => '13203',
        'name' => '武蔵野市',
      ),
      26 => 
      array (
        'id' => '13204',
        'name' => '三鷹市',
      ),
      27 => 
      array (
        'id' => '13205',
        'name' => '青梅市',
      ),
      28 => 
      array (
        'id' => '13206',
        'name' => '府中市',
      ),
      29 => 
      array (
        'id' => '13207',
        'name' => '昭島市',
      ),
      30 => 
      array (
        'id' => '13208',
        'name' => '調布市',
      ),
      31 => 
      array (
        'id' => '13209',
        'name' => '町田市',
      ),
      32 => 
      array (
        'id' => '13210',
        'name' => '小金井市',
      ),
      33 => 
      array (
        'id' => '13211',
        'name' => '小平市',
      ),
      34 => 
      array (
        'id' => '13212',
        'name' => '日野市',
      ),
      35 => 
      array (
        'id' => '13213',
        'name' => '東村山市',
      ),
      36 => 
      array (
        'id' => '13214',
        'name' => '国分寺市',
      ),
      37 => 
      array (
        'id' => '13215',
        'name' => '国立市',
      ),
      38 => 
      array (
        'id' => '13218',
        'name' => '福生市',
      ),
      39 => 
      array (
        'id' => '13219',
        'name' => '狛江市',
      ),
      40 => 
      array (
        'id' => '13220',
        'name' => '東大和市',
      ),
      41 => 
      array (
        'id' => '13221',
        'name' => '清瀬市',
      ),
      42 => 
      array (
        'id' => '13222',
        'name' => '東久留米市',
      ),
      43 => 
      array (
        'id' => '13223',
        'name' => '武蔵村山市',
      ),
      44 => 
      array (
        'id' => '13224',
        'name' => '多摩市',
      ),
      45 => 
      array (
        'id' => '13225',
        'name' => '稲城市',
      ),
      46 => 
      array (
        'id' => '13227',
        'name' => '羽村市',
      ),
      47 => 
      array (
        'id' => '13228',
        'name' => 'あきる野市',
      ),
      48 => 
      array (
        'id' => '13229',
        'name' => '西東京市',
      ),
      49 => 
      array (
        'id' => '13303',
        'name' => '瑞穂町',
      ),
      50 => 
      array (
        'id' => '13305',
        'name' => '日の出町',
      ),
      51 => 
      array (
        'id' => '13307',
        'name' => '檜原村',
      ),
      52 => 
      array (
        'id' => '13308',
        'name' => '奥多摩町',
      ),
      53 => 
      array (
        'id' => '13361',
        'name' => '大島町',
      ),
      54 => 
      array (
        'id' => '13362',
        'name' => '利島村',
      ),
      55 => 
      array (
        'id' => '13363',
        'name' => '新島村',
      ),
      56 => 
      array (
        'id' => '13364',
        'name' => '神津島村',
      ),
      57 => 
      array (
        'id' => '13381',
        'name' => '三宅村',
      ),
      58 => 
      array (
        'id' => '13382',
        'name' => '御蔵島村',
      ),
      59 => 
      array (
        'id' => '13401',
        'name' => '八丈町',
      ),
      60 => 
      array (
        'id' => '13402',
        'name' => '青ヶ島村',
      ),
      61 => 
      array (
        'id' => '13421',
        'name' => '小笠原村',
      ),
    ),
  ),
  13 => 
  array (
    'id' => '14',
    'pref' => '神奈川県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '14100',
        'name' => '横浜市',
      ),
      1 => 
      array (
        'id' => '14101',
        'name' => '鶴見区',
      ),
      2 => 
      array (
        'id' => '14102',
        'name' => '神奈川区',
      ),
      3 => 
      array (
        'id' => '14103',
        'name' => '西区',
      ),
      4 => 
      array (
        'id' => '14104',
        'name' => '中区',
      ),
      5 => 
      array (
        'id' => '14105',
        'name' => '南区',
      ),
      6 => 
      array (
        'id' => '14106',
        'name' => '保土ケ谷区',
      ),
      7 => 
      array (
        'id' => '14107',
        'name' => '磯子区',
      ),
      8 => 
      array (
        'id' => '14108',
        'name' => '金沢区',
      ),
      9 => 
      array (
        'id' => '14109',
        'name' => '港北区',
      ),
      10 => 
      array (
        'id' => '14110',
        'name' => '戸塚区',
      ),
      11 => 
      array (
        'id' => '14111',
        'name' => '港南区',
      ),
      12 => 
      array (
        'id' => '14112',
        'name' => '旭区',
      ),
      13 => 
      array (
        'id' => '14113',
        'name' => '緑区',
      ),
      14 => 
      array (
        'id' => '14114',
        'name' => '瀬谷区',
      ),
      15 => 
      array (
        'id' => '14115',
        'name' => '栄区',
      ),
      16 => 
      array (
        'id' => '14116',
        'name' => '泉区',
      ),
      17 => 
      array (
        'id' => '14117',
        'name' => '青葉区',
      ),
      18 => 
      array (
        'id' => '14118',
        'name' => '都筑区',
      ),
      19 => 
      array (
        'id' => '14130',
        'name' => '川崎市',
      ),
      20 => 
      array (
        'id' => '14131',
        'name' => '川崎区',
      ),
      21 => 
      array (
        'id' => '14132',
        'name' => '幸区',
      ),
      22 => 
      array (
        'id' => '14133',
        'name' => '中原区',
      ),
      23 => 
      array (
        'id' => '14134',
        'name' => '高津区',
      ),
      24 => 
      array (
        'id' => '14135',
        'name' => '多摩区',
      ),
      25 => 
      array (
        'id' => '14136',
        'name' => '宮前区',
      ),
      26 => 
      array (
        'id' => '14137',
        'name' => '麻生区',
      ),
      27 => 
      array (
        'id' => '14150',
        'name' => '相模原市',
      ),
      28 => 
      array (
        'id' => '14151',
        'name' => '緑区',
      ),
      29 => 
      array (
        'id' => '14152',
        'name' => '中央区',
      ),
      30 => 
      array (
        'id' => '14153',
        'name' => '南区',
      ),
      31 => 
      array (
        'id' => '14201',
        'name' => '横須賀市',
      ),
      32 => 
      array (
        'id' => '14203',
        'name' => '平塚市',
      ),
      33 => 
      array (
        'id' => '14204',
        'name' => '鎌倉市',
      ),
      34 => 
      array (
        'id' => '14205',
        'name' => '藤沢市',
      ),
      35 => 
      array (
        'id' => '14206',
        'name' => '小田原市',
      ),
      36 => 
      array (
        'id' => '14207',
        'name' => '茅ヶ崎市',
      ),
      37 => 
      array (
        'id' => '14208',
        'name' => '逗子市',
      ),
      38 => 
      array (
        'id' => '14210',
        'name' => '三浦市',
      ),
      39 => 
      array (
        'id' => '14211',
        'name' => '秦野市',
      ),
      40 => 
      array (
        'id' => '14212',
        'name' => '厚木市',
      ),
      41 => 
      array (
        'id' => '14213',
        'name' => '大和市',
      ),
      42 => 
      array (
        'id' => '14214',
        'name' => '伊勢原市',
      ),
      43 => 
      array (
        'id' => '14215',
        'name' => '海老名市',
      ),
      44 => 
      array (
        'id' => '14216',
        'name' => '座間市',
      ),
      45 => 
      array (
        'id' => '14217',
        'name' => '南足柄市',
      ),
      46 => 
      array (
        'id' => '14218',
        'name' => '綾瀬市',
      ),
      47 => 
      array (
        'id' => '14301',
        'name' => '葉山町',
      ),
      48 => 
      array (
        'id' => '14321',
        'name' => '寒川町',
      ),
      49 => 
      array (
        'id' => '14341',
        'name' => '大磯町',
      ),
      50 => 
      array (
        'id' => '14342',
        'name' => '二宮町',
      ),
      51 => 
      array (
        'id' => '14361',
        'name' => '中井町',
      ),
      52 => 
      array (
        'id' => '14362',
        'name' => '大井町',
      ),
      53 => 
      array (
        'id' => '14363',
        'name' => '松田町',
      ),
      54 => 
      array (
        'id' => '14364',
        'name' => '山北町',
      ),
      55 => 
      array (
        'id' => '14366',
        'name' => '開成町',
      ),
      56 => 
      array (
        'id' => '14382',
        'name' => '箱根町',
      ),
      57 => 
      array (
        'id' => '14383',
        'name' => '真鶴町',
      ),
      58 => 
      array (
        'id' => '14384',
        'name' => '湯河原町',
      ),
      59 => 
      array (
        'id' => '14401',
        'name' => '愛川町',
      ),
      60 => 
      array (
        'id' => '14402',
        'name' => '清川村',
      ),
    ),
  ),
  14 => 
  array (
    'id' => '15',
    'pref' => '新潟県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '15100',
        'name' => '新潟市',
      ),
      1 => 
      array (
        'id' => '15101',
        'name' => '北区',
      ),
      2 => 
      array (
        'id' => '15102',
        'name' => '東区',
      ),
      3 => 
      array (
        'id' => '15103',
        'name' => '中央区',
      ),
      4 => 
      array (
        'id' => '15104',
        'name' => '江南区',
      ),
      5 => 
      array (
        'id' => '15105',
        'name' => '秋葉区',
      ),
      6 => 
      array (
        'id' => '15106',
        'name' => '南区',
      ),
      7 => 
      array (
        'id' => '15107',
        'name' => '西区',
      ),
      8 => 
      array (
        'id' => '15108',
        'name' => '西蒲区',
      ),
      9 => 
      array (
        'id' => '15202',
        'name' => '長岡市',
      ),
      10 => 
      array (
        'id' => '15204',
        'name' => '三条市',
      ),
      11 => 
      array (
        'id' => '15205',
        'name' => '柏崎市',
      ),
      12 => 
      array (
        'id' => '15206',
        'name' => '新発田市',
      ),
      13 => 
      array (
        'id' => '15208',
        'name' => '小千谷市',
      ),
      14 => 
      array (
        'id' => '15209',
        'name' => '加茂市',
      ),
      15 => 
      array (
        'id' => '15210',
        'name' => '十日町市',
      ),
      16 => 
      array (
        'id' => '15211',
        'name' => '見附市',
      ),
      17 => 
      array (
        'id' => '15212',
        'name' => '村上市',
      ),
      18 => 
      array (
        'id' => '15213',
        'name' => '燕市',
      ),
      19 => 
      array (
        'id' => '15216',
        'name' => '糸魚川市',
      ),
      20 => 
      array (
        'id' => '15217',
        'name' => '妙高市',
      ),
      21 => 
      array (
        'id' => '15218',
        'name' => '五泉市',
      ),
      22 => 
      array (
        'id' => '15222',
        'name' => '上越市',
      ),
      23 => 
      array (
        'id' => '15223',
        'name' => '阿賀野市',
      ),
      24 => 
      array (
        'id' => '15224',
        'name' => '佐渡市',
      ),
      25 => 
      array (
        'id' => '15225',
        'name' => '魚沼市',
      ),
      26 => 
      array (
        'id' => '15226',
        'name' => '南魚沼市',
      ),
      27 => 
      array (
        'id' => '15227',
        'name' => '胎内市',
      ),
      28 => 
      array (
        'id' => '15307',
        'name' => '聖籠町',
      ),
      29 => 
      array (
        'id' => '15342',
        'name' => '弥彦村',
      ),
      30 => 
      array (
        'id' => '15361',
        'name' => '田上町',
      ),
      31 => 
      array (
        'id' => '15385',
        'name' => '阿賀町',
      ),
      32 => 
      array (
        'id' => '15405',
        'name' => '出雲崎町',
      ),
      33 => 
      array (
        'id' => '15461',
        'name' => '湯沢町',
      ),
      34 => 
      array (
        'id' => '15482',
        'name' => '津南町',
      ),
      35 => 
      array (
        'id' => '15504',
        'name' => '刈羽村',
      ),
      36 => 
      array (
        'id' => '15581',
        'name' => '関川村',
      ),
      37 => 
      array (
        'id' => '15586',
        'name' => '粟島浦村',
      ),
    ),
  ),
  15 => 
  array (
    'id' => '16',
    'pref' => '富山県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '16201',
        'name' => '富山市',
      ),
      1 => 
      array (
        'id' => '16202',
        'name' => '高岡市',
      ),
      2 => 
      array (
        'id' => '16204',
        'name' => '魚津市',
      ),
      3 => 
      array (
        'id' => '16205',
        'name' => '氷見市',
      ),
      4 => 
      array (
        'id' => '16206',
        'name' => '滑川市',
      ),
      5 => 
      array (
        'id' => '16207',
        'name' => '黒部市',
      ),
      6 => 
      array (
        'id' => '16208',
        'name' => '砺波市',
      ),
      7 => 
      array (
        'id' => '16209',
        'name' => '小矢部市',
      ),
      8 => 
      array (
        'id' => '16210',
        'name' => '南砺市',
      ),
      9 => 
      array (
        'id' => '16211',
        'name' => '射水市',
      ),
      10 => 
      array (
        'id' => '16321',
        'name' => '舟橋村',
      ),
      11 => 
      array (
        'id' => '16322',
        'name' => '上市町',
      ),
      12 => 
      array (
        'id' => '16323',
        'name' => '立山町',
      ),
      13 => 
      array (
        'id' => '16342',
        'name' => '入善町',
      ),
      14 => 
      array (
        'id' => '16343',
        'name' => '朝日町',
      ),
    ),
  ),
  16 => 
  array (
    'id' => '17',
    'pref' => '石川県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '17201',
        'name' => '金沢市',
      ),
      1 => 
      array (
        'id' => '17202',
        'name' => '七尾市',
      ),
      2 => 
      array (
        'id' => '17203',
        'name' => '小松市',
      ),
      3 => 
      array (
        'id' => '17204',
        'name' => '輪島市',
      ),
      4 => 
      array (
        'id' => '17205',
        'name' => '珠洲市',
      ),
      5 => 
      array (
        'id' => '17206',
        'name' => '加賀市',
      ),
      6 => 
      array (
        'id' => '17207',
        'name' => '羽咋市',
      ),
      7 => 
      array (
        'id' => '17209',
        'name' => 'かほく市',
      ),
      8 => 
      array (
        'id' => '17210',
        'name' => '白山市',
      ),
      9 => 
      array (
        'id' => '17211',
        'name' => '能美市',
      ),
      10 => 
      array (
        'id' => '17212',
        'name' => '野々市市',
      ),
      11 => 
      array (
        'id' => '17324',
        'name' => '川北町',
      ),
      12 => 
      array (
        'id' => '17361',
        'name' => '津幡町',
      ),
      13 => 
      array (
        'id' => '17365',
        'name' => '内灘町',
      ),
      14 => 
      array (
        'id' => '17384',
        'name' => '志賀町',
      ),
      15 => 
      array (
        'id' => '17386',
        'name' => '宝達志水町',
      ),
      16 => 
      array (
        'id' => '17407',
        'name' => '中能登町',
      ),
      17 => 
      array (
        'id' => '17461',
        'name' => '穴水町',
      ),
      18 => 
      array (
        'id' => '17463',
        'name' => '能登町',
      ),
    ),
  ),
  17 => 
  array (
    'id' => '18',
    'pref' => '福井県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '18201',
        'name' => '福井市',
      ),
      1 => 
      array (
        'id' => '18202',
        'name' => '敦賀市',
      ),
      2 => 
      array (
        'id' => '18204',
        'name' => '小浜市',
      ),
      3 => 
      array (
        'id' => '18205',
        'name' => '大野市',
      ),
      4 => 
      array (
        'id' => '18206',
        'name' => '勝山市',
      ),
      5 => 
      array (
        'id' => '18207',
        'name' => '鯖江市',
      ),
      6 => 
      array (
        'id' => '18208',
        'name' => 'あわら市',
      ),
      7 => 
      array (
        'id' => '18209',
        'name' => '越前市',
      ),
      8 => 
      array (
        'id' => '18210',
        'name' => '坂井市',
      ),
      9 => 
      array (
        'id' => '18322',
        'name' => '永平寺町',
      ),
      10 => 
      array (
        'id' => '18382',
        'name' => '池田町',
      ),
      11 => 
      array (
        'id' => '18404',
        'name' => '南越前町',
      ),
      12 => 
      array (
        'id' => '18423',
        'name' => '越前町',
      ),
      13 => 
      array (
        'id' => '18442',
        'name' => '美浜町',
      ),
      14 => 
      array (
        'id' => '18481',
        'name' => '高浜町',
      ),
      15 => 
      array (
        'id' => '18483',
        'name' => 'おおい町',
      ),
      16 => 
      array (
        'id' => '18501',
        'name' => '若狭町',
      ),
    ),
  ),
  18 => 
  array (
    'id' => '19',
    'pref' => '山梨県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '19201',
        'name' => '甲府市',
      ),
      1 => 
      array (
        'id' => '19202',
        'name' => '富士吉田市',
      ),
      2 => 
      array (
        'id' => '19204',
        'name' => '都留市',
      ),
      3 => 
      array (
        'id' => '19205',
        'name' => '山梨市',
      ),
      4 => 
      array (
        'id' => '19206',
        'name' => '大月市',
      ),
      5 => 
      array (
        'id' => '19207',
        'name' => '韮崎市',
      ),
      6 => 
      array (
        'id' => '19208',
        'name' => '南アルプス市',
      ),
      7 => 
      array (
        'id' => '19209',
        'name' => '北杜市',
      ),
      8 => 
      array (
        'id' => '19210',
        'name' => '甲斐市',
      ),
      9 => 
      array (
        'id' => '19211',
        'name' => '笛吹市',
      ),
      10 => 
      array (
        'id' => '19212',
        'name' => '上野原市',
      ),
      11 => 
      array (
        'id' => '19213',
        'name' => '甲州市',
      ),
      12 => 
      array (
        'id' => '19214',
        'name' => '中央市',
      ),
      13 => 
      array (
        'id' => '19346',
        'name' => '市川三郷町',
      ),
      14 => 
      array (
        'id' => '19364',
        'name' => '早川町',
      ),
      15 => 
      array (
        'id' => '19365',
        'name' => '身延町',
      ),
      16 => 
      array (
        'id' => '19366',
        'name' => '南部町',
      ),
      17 => 
      array (
        'id' => '19368',
        'name' => '富士川町',
      ),
      18 => 
      array (
        'id' => '19384',
        'name' => '昭和町',
      ),
      19 => 
      array (
        'id' => '19422',
        'name' => '道志村',
      ),
      20 => 
      array (
        'id' => '19423',
        'name' => '西桂町',
      ),
      21 => 
      array (
        'id' => '19424',
        'name' => '忍野村',
      ),
      22 => 
      array (
        'id' => '19425',
        'name' => '山中湖村',
      ),
      23 => 
      array (
        'id' => '19429',
        'name' => '鳴沢村',
      ),
      24 => 
      array (
        'id' => '19430',
        'name' => '富士河口湖町',
      ),
      25 => 
      array (
        'id' => '19442',
        'name' => '小菅村',
      ),
      26 => 
      array (
        'id' => '19443',
        'name' => '丹波山村',
      ),
    ),
  ),
  19 => 
  array (
    'id' => '20',
    'pref' => '長野県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '20201',
        'name' => '長野市',
      ),
      1 => 
      array (
        'id' => '20202',
        'name' => '松本市',
      ),
      2 => 
      array (
        'id' => '20203',
        'name' => '上田市',
      ),
      3 => 
      array (
        'id' => '20204',
        'name' => '岡谷市',
      ),
      4 => 
      array (
        'id' => '20205',
        'name' => '飯田市',
      ),
      5 => 
      array (
        'id' => '20206',
        'name' => '諏訪市',
      ),
      6 => 
      array (
        'id' => '20207',
        'name' => '須坂市',
      ),
      7 => 
      array (
        'id' => '20208',
        'name' => '小諸市',
      ),
      8 => 
      array (
        'id' => '20209',
        'name' => '伊那市',
      ),
      9 => 
      array (
        'id' => '20210',
        'name' => '駒ヶ根市',
      ),
      10 => 
      array (
        'id' => '20211',
        'name' => '中野市',
      ),
      11 => 
      array (
        'id' => '20212',
        'name' => '大町市',
      ),
      12 => 
      array (
        'id' => '20213',
        'name' => '飯山市',
      ),
      13 => 
      array (
        'id' => '20214',
        'name' => '茅野市',
      ),
      14 => 
      array (
        'id' => '20215',
        'name' => '塩尻市',
      ),
      15 => 
      array (
        'id' => '20217',
        'name' => '佐久市',
      ),
      16 => 
      array (
        'id' => '20218',
        'name' => '千曲市',
      ),
      17 => 
      array (
        'id' => '20219',
        'name' => '東御市',
      ),
      18 => 
      array (
        'id' => '20220',
        'name' => '安曇野市',
      ),
      19 => 
      array (
        'id' => '20303',
        'name' => '小海町',
      ),
      20 => 
      array (
        'id' => '20304',
        'name' => '川上村',
      ),
      21 => 
      array (
        'id' => '20305',
        'name' => '南牧村',
      ),
      22 => 
      array (
        'id' => '20306',
        'name' => '南相木村',
      ),
      23 => 
      array (
        'id' => '20307',
        'name' => '北相木村',
      ),
      24 => 
      array (
        'id' => '20309',
        'name' => '佐久穂町',
      ),
      25 => 
      array (
        'id' => '20321',
        'name' => '軽井沢町',
      ),
      26 => 
      array (
        'id' => '20323',
        'name' => '御代田町',
      ),
      27 => 
      array (
        'id' => '20324',
        'name' => '立科町',
      ),
      28 => 
      array (
        'id' => '20349',
        'name' => '青木村',
      ),
      29 => 
      array (
        'id' => '20350',
        'name' => '長和町',
      ),
      30 => 
      array (
        'id' => '20361',
        'name' => '下諏訪町',
      ),
      31 => 
      array (
        'id' => '20362',
        'name' => '富士見町',
      ),
      32 => 
      array (
        'id' => '20363',
        'name' => '原村',
      ),
      33 => 
      array (
        'id' => '20382',
        'name' => '辰野町',
      ),
      34 => 
      array (
        'id' => '20383',
        'name' => '箕輪町',
      ),
      35 => 
      array (
        'id' => '20384',
        'name' => '飯島町',
      ),
      36 => 
      array (
        'id' => '20385',
        'name' => '南箕輪村',
      ),
      37 => 
      array (
        'id' => '20386',
        'name' => '中川村',
      ),
      38 => 
      array (
        'id' => '20388',
        'name' => '宮田村',
      ),
      39 => 
      array (
        'id' => '20402',
        'name' => '松川町',
      ),
      40 => 
      array (
        'id' => '20403',
        'name' => '高森町',
      ),
      41 => 
      array (
        'id' => '20404',
        'name' => '阿南町',
      ),
      42 => 
      array (
        'id' => '20407',
        'name' => '阿智村',
      ),
      43 => 
      array (
        'id' => '20409',
        'name' => '平谷村',
      ),
      44 => 
      array (
        'id' => '20410',
        'name' => '根羽村',
      ),
      45 => 
      array (
        'id' => '20411',
        'name' => '下條村',
      ),
      46 => 
      array (
        'id' => '20412',
        'name' => '売木村',
      ),
      47 => 
      array (
        'id' => '20413',
        'name' => '天龍村',
      ),
      48 => 
      array (
        'id' => '20414',
        'name' => '泰阜村',
      ),
      49 => 
      array (
        'id' => '20415',
        'name' => '喬木村',
      ),
      50 => 
      array (
        'id' => '20416',
        'name' => '豊丘村',
      ),
      51 => 
      array (
        'id' => '20417',
        'name' => '大鹿村',
      ),
      52 => 
      array (
        'id' => '20422',
        'name' => '上松町',
      ),
      53 => 
      array (
        'id' => '20423',
        'name' => '南木曽町',
      ),
      54 => 
      array (
        'id' => '20425',
        'name' => '木祖村',
      ),
      55 => 
      array (
        'id' => '20429',
        'name' => '王滝村',
      ),
      56 => 
      array (
        'id' => '20430',
        'name' => '大桑村',
      ),
      57 => 
      array (
        'id' => '20432',
        'name' => '木曽町',
      ),
      58 => 
      array (
        'id' => '20446',
        'name' => '麻績村',
      ),
      59 => 
      array (
        'id' => '20448',
        'name' => '生坂村',
      ),
      60 => 
      array (
        'id' => '20450',
        'name' => '山形村',
      ),
      61 => 
      array (
        'id' => '20451',
        'name' => '朝日村',
      ),
      62 => 
      array (
        'id' => '20452',
        'name' => '筑北村',
      ),
      63 => 
      array (
        'id' => '20481',
        'name' => '池田町',
      ),
      64 => 
      array (
        'id' => '20482',
        'name' => '松川村',
      ),
      65 => 
      array (
        'id' => '20485',
        'name' => '白馬村',
      ),
      66 => 
      array (
        'id' => '20486',
        'name' => '小谷村',
      ),
      67 => 
      array (
        'id' => '20521',
        'name' => '坂城町',
      ),
      68 => 
      array (
        'id' => '20541',
        'name' => '小布施町',
      ),
      69 => 
      array (
        'id' => '20543',
        'name' => '高山村',
      ),
      70 => 
      array (
        'id' => '20561',
        'name' => '山ノ内町',
      ),
      71 => 
      array (
        'id' => '20562',
        'name' => '木島平村',
      ),
      72 => 
      array (
        'id' => '20563',
        'name' => '野沢温泉村',
      ),
      73 => 
      array (
        'id' => '20583',
        'name' => '信濃町',
      ),
      74 => 
      array (
        'id' => '20588',
        'name' => '小川村',
      ),
      75 => 
      array (
        'id' => '20590',
        'name' => '飯綱町',
      ),
      76 => 
      array (
        'id' => '20602',
        'name' => '栄村',
      ),
    ),
  ),
  20 => 
  array (
    'id' => '21',
    'pref' => '岐阜県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '21201',
        'name' => '岐阜市',
      ),
      1 => 
      array (
        'id' => '21202',
        'name' => '大垣市',
      ),
      2 => 
      array (
        'id' => '21203',
        'name' => '高山市',
      ),
      3 => 
      array (
        'id' => '21204',
        'name' => '多治見市',
      ),
      4 => 
      array (
        'id' => '21205',
        'name' => '関市',
      ),
      5 => 
      array (
        'id' => '21206',
        'name' => '中津川市',
      ),
      6 => 
      array (
        'id' => '21207',
        'name' => '美濃市',
      ),
      7 => 
      array (
        'id' => '21208',
        'name' => '瑞浪市',
      ),
      8 => 
      array (
        'id' => '21209',
        'name' => '羽島市',
      ),
      9 => 
      array (
        'id' => '21210',
        'name' => '恵那市',
      ),
      10 => 
      array (
        'id' => '21211',
        'name' => '美濃加茂市',
      ),
      11 => 
      array (
        'id' => '21212',
        'name' => '土岐市',
      ),
      12 => 
      array (
        'id' => '21213',
        'name' => '各務原市',
      ),
      13 => 
      array (
        'id' => '21214',
        'name' => '可児市',
      ),
      14 => 
      array (
        'id' => '21215',
        'name' => '山県市',
      ),
      15 => 
      array (
        'id' => '21216',
        'name' => '瑞穂市',
      ),
      16 => 
      array (
        'id' => '21217',
        'name' => '飛騨市',
      ),
      17 => 
      array (
        'id' => '21218',
        'name' => '本巣市',
      ),
      18 => 
      array (
        'id' => '21219',
        'name' => '郡上市',
      ),
      19 => 
      array (
        'id' => '21220',
        'name' => '下呂市',
      ),
      20 => 
      array (
        'id' => '21221',
        'name' => '海津市',
      ),
      21 => 
      array (
        'id' => '21302',
        'name' => '岐南町',
      ),
      22 => 
      array (
        'id' => '21303',
        'name' => '笠松町',
      ),
      23 => 
      array (
        'id' => '21341',
        'name' => '養老町',
      ),
      24 => 
      array (
        'id' => '21361',
        'name' => '垂井町',
      ),
      25 => 
      array (
        'id' => '21362',
        'name' => '関ケ原町',
      ),
      26 => 
      array (
        'id' => '21381',
        'name' => '神戸町',
      ),
      27 => 
      array (
        'id' => '21382',
        'name' => '輪之内町',
      ),
      28 => 
      array (
        'id' => '21383',
        'name' => '安八町',
      ),
      29 => 
      array (
        'id' => '21401',
        'name' => '揖斐川町',
      ),
      30 => 
      array (
        'id' => '21403',
        'name' => '大野町',
      ),
      31 => 
      array (
        'id' => '21404',
        'name' => '池田町',
      ),
      32 => 
      array (
        'id' => '21421',
        'name' => '北方町',
      ),
      33 => 
      array (
        'id' => '21501',
        'name' => '坂祝町',
      ),
      34 => 
      array (
        'id' => '21502',
        'name' => '富加町',
      ),
      35 => 
      array (
        'id' => '21503',
        'name' => '川辺町',
      ),
      36 => 
      array (
        'id' => '21504',
        'name' => '七宗町',
      ),
      37 => 
      array (
        'id' => '21505',
        'name' => '八百津町',
      ),
      38 => 
      array (
        'id' => '21506',
        'name' => '白川町',
      ),
      39 => 
      array (
        'id' => '21507',
        'name' => '東白川村',
      ),
      40 => 
      array (
        'id' => '21521',
        'name' => '御嵩町',
      ),
      41 => 
      array (
        'id' => '21604',
        'name' => '白川村',
      ),
    ),
  ),
  21 => 
  array (
    'id' => '22',
    'pref' => '静岡県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '22100',
        'name' => '静岡市',
      ),
      1 => 
      array (
        'id' => '22101',
        'name' => '葵区',
      ),
      2 => 
      array (
        'id' => '22102',
        'name' => '駿河区',
      ),
      3 => 
      array (
        'id' => '22103',
        'name' => '清水区',
      ),
      4 => 
      array (
        'id' => '22130',
        'name' => '浜松市',
      ),
      5 => 
      array (
        'id' => '22131',
        'name' => '中区',
      ),
      6 => 
      array (
        'id' => '22132',
        'name' => '東区',
      ),
      7 => 
      array (
        'id' => '22133',
        'name' => '西区',
      ),
      8 => 
      array (
        'id' => '22134',
        'name' => '南区',
      ),
      9 => 
      array (
        'id' => '22135',
        'name' => '北区',
      ),
      10 => 
      array (
        'id' => '22136',
        'name' => '浜北区',
      ),
      11 => 
      array (
        'id' => '22137',
        'name' => '天竜区',
      ),
      12 => 
      array (
        'id' => '22203',
        'name' => '沼津市',
      ),
      13 => 
      array (
        'id' => '22205',
        'name' => '熱海市',
      ),
      14 => 
      array (
        'id' => '22206',
        'name' => '三島市',
      ),
      15 => 
      array (
        'id' => '22207',
        'name' => '富士宮市',
      ),
      16 => 
      array (
        'id' => '22208',
        'name' => '伊東市',
      ),
      17 => 
      array (
        'id' => '22209',
        'name' => '島田市',
      ),
      18 => 
      array (
        'id' => '22210',
        'name' => '富士市',
      ),
      19 => 
      array (
        'id' => '22211',
        'name' => '磐田市',
      ),
      20 => 
      array (
        'id' => '22212',
        'name' => '焼津市',
      ),
      21 => 
      array (
        'id' => '22213',
        'name' => '掛川市',
      ),
      22 => 
      array (
        'id' => '22214',
        'name' => '藤枝市',
      ),
      23 => 
      array (
        'id' => '22215',
        'name' => '御殿場市',
      ),
      24 => 
      array (
        'id' => '22216',
        'name' => '袋井市',
      ),
      25 => 
      array (
        'id' => '22219',
        'name' => '下田市',
      ),
      26 => 
      array (
        'id' => '22220',
        'name' => '裾野市',
      ),
      27 => 
      array (
        'id' => '22221',
        'name' => '湖西市',
      ),
      28 => 
      array (
        'id' => '22222',
        'name' => '伊豆市',
      ),
      29 => 
      array (
        'id' => '22223',
        'name' => '御前崎市',
      ),
      30 => 
      array (
        'id' => '22224',
        'name' => '菊川市',
      ),
      31 => 
      array (
        'id' => '22225',
        'name' => '伊豆の国市',
      ),
      32 => 
      array (
        'id' => '22226',
        'name' => '牧之原市',
      ),
      33 => 
      array (
        'id' => '22301',
        'name' => '東伊豆町',
      ),
      34 => 
      array (
        'id' => '22302',
        'name' => '河津町',
      ),
      35 => 
      array (
        'id' => '22304',
        'name' => '南伊豆町',
      ),
      36 => 
      array (
        'id' => '22305',
        'name' => '松崎町',
      ),
      37 => 
      array (
        'id' => '22306',
        'name' => '西伊豆町',
      ),
      38 => 
      array (
        'id' => '22325',
        'name' => '函南町',
      ),
      39 => 
      array (
        'id' => '22341',
        'name' => '清水町',
      ),
      40 => 
      array (
        'id' => '22342',
        'name' => '長泉町',
      ),
      41 => 
      array (
        'id' => '22344',
        'name' => '小山町',
      ),
      42 => 
      array (
        'id' => '22424',
        'name' => '吉田町',
      ),
      43 => 
      array (
        'id' => '22429',
        'name' => '川根本町',
      ),
      44 => 
      array (
        'id' => '22461',
        'name' => '森町',
      ),
    ),
  ),
  22 => 
  array (
    'id' => '23',
    'pref' => '愛知県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '23100',
        'name' => '名古屋市',
      ),
      1 => 
      array (
        'id' => '23101',
        'name' => '千種区',
      ),
      2 => 
      array (
        'id' => '23102',
        'name' => '東区',
      ),
      3 => 
      array (
        'id' => '23103',
        'name' => '北区',
      ),
      4 => 
      array (
        'id' => '23104',
        'name' => '西区',
      ),
      5 => 
      array (
        'id' => '23105',
        'name' => '中村区',
      ),
      6 => 
      array (
        'id' => '23106',
        'name' => '中区',
      ),
      7 => 
      array (
        'id' => '23107',
        'name' => '昭和区',
      ),
      8 => 
      array (
        'id' => '23108',
        'name' => '瑞穂区',
      ),
      9 => 
      array (
        'id' => '23109',
        'name' => '熱田区',
      ),
      10 => 
      array (
        'id' => '23110',
        'name' => '中川区',
      ),
      11 => 
      array (
        'id' => '23111',
        'name' => '港区',
      ),
      12 => 
      array (
        'id' => '23112',
        'name' => '南区',
      ),
      13 => 
      array (
        'id' => '23113',
        'name' => '守山区',
      ),
      14 => 
      array (
        'id' => '23114',
        'name' => '緑区',
      ),
      15 => 
      array (
        'id' => '23115',
        'name' => '名東区',
      ),
      16 => 
      array (
        'id' => '23116',
        'name' => '天白区',
      ),
      17 => 
      array (
        'id' => '23201',
        'name' => '豊橋市',
      ),
      18 => 
      array (
        'id' => '23202',
        'name' => '岡崎市',
      ),
      19 => 
      array (
        'id' => '23203',
        'name' => '一宮市',
      ),
      20 => 
      array (
        'id' => '23204',
        'name' => '瀬戸市',
      ),
      21 => 
      array (
        'id' => '23205',
        'name' => '半田市',
      ),
      22 => 
      array (
        'id' => '23206',
        'name' => '春日井市',
      ),
      23 => 
      array (
        'id' => '23207',
        'name' => '豊川市',
      ),
      24 => 
      array (
        'id' => '23208',
        'name' => '津島市',
      ),
      25 => 
      array (
        'id' => '23209',
        'name' => '碧南市',
      ),
      26 => 
      array (
        'id' => '23210',
        'name' => '刈谷市',
      ),
      27 => 
      array (
        'id' => '23211',
        'name' => '豊田市',
      ),
      28 => 
      array (
        'id' => '23212',
        'name' => '安城市',
      ),
      29 => 
      array (
        'id' => '23213',
        'name' => '西尾市',
      ),
      30 => 
      array (
        'id' => '23214',
        'name' => '蒲郡市',
      ),
      31 => 
      array (
        'id' => '23215',
        'name' => '犬山市',
      ),
      32 => 
      array (
        'id' => '23216',
        'name' => '常滑市',
      ),
      33 => 
      array (
        'id' => '23217',
        'name' => '江南市',
      ),
      34 => 
      array (
        'id' => '23219',
        'name' => '小牧市',
      ),
      35 => 
      array (
        'id' => '23220',
        'name' => '稲沢市',
      ),
      36 => 
      array (
        'id' => '23221',
        'name' => '新城市',
      ),
      37 => 
      array (
        'id' => '23222',
        'name' => '東海市',
      ),
      38 => 
      array (
        'id' => '23223',
        'name' => '大府市',
      ),
      39 => 
      array (
        'id' => '23224',
        'name' => '知多市',
      ),
      40 => 
      array (
        'id' => '23225',
        'name' => '知立市',
      ),
      41 => 
      array (
        'id' => '23226',
        'name' => '尾張旭市',
      ),
      42 => 
      array (
        'id' => '23227',
        'name' => '高浜市',
      ),
      43 => 
      array (
        'id' => '23228',
        'name' => '岩倉市',
      ),
      44 => 
      array (
        'id' => '23229',
        'name' => '豊明市',
      ),
      45 => 
      array (
        'id' => '23230',
        'name' => '日進市',
      ),
      46 => 
      array (
        'id' => '23231',
        'name' => '田原市',
      ),
      47 => 
      array (
        'id' => '23232',
        'name' => '愛西市',
      ),
      48 => 
      array (
        'id' => '23233',
        'name' => '清須市',
      ),
      49 => 
      array (
        'id' => '23234',
        'name' => '北名古屋市',
      ),
      50 => 
      array (
        'id' => '23235',
        'name' => '弥富市',
      ),
      51 => 
      array (
        'id' => '23236',
        'name' => 'みよし市',
      ),
      52 => 
      array (
        'id' => '23237',
        'name' => 'あま市',
      ),
      53 => 
      array (
        'id' => '23238',
        'name' => '長久手市',
      ),
      54 => 
      array (
        'id' => '23302',
        'name' => '東郷町',
      ),
      55 => 
      array (
        'id' => '23342',
        'name' => '豊山町',
      ),
      56 => 
      array (
        'id' => '23361',
        'name' => '大口町',
      ),
      57 => 
      array (
        'id' => '23362',
        'name' => '扶桑町',
      ),
      58 => 
      array (
        'id' => '23424',
        'name' => '大治町',
      ),
      59 => 
      array (
        'id' => '23425',
        'name' => '蟹江町',
      ),
      60 => 
      array (
        'id' => '23427',
        'name' => '飛島村',
      ),
      61 => 
      array (
        'id' => '23441',
        'name' => '阿久比町',
      ),
      62 => 
      array (
        'id' => '23442',
        'name' => '東浦町',
      ),
      63 => 
      array (
        'id' => '23445',
        'name' => '南知多町',
      ),
      64 => 
      array (
        'id' => '23446',
        'name' => '美浜町',
      ),
      65 => 
      array (
        'id' => '23447',
        'name' => '武豊町',
      ),
      66 => 
      array (
        'id' => '23501',
        'name' => '幸田町',
      ),
      67 => 
      array (
        'id' => '23561',
        'name' => '設楽町',
      ),
      68 => 
      array (
        'id' => '23562',
        'name' => '東栄町',
      ),
      69 => 
      array (
        'id' => '23563',
        'name' => '豊根村',
      ),
    ),
  ),
  23 => 
  array (
    'id' => '24',
    'pref' => '三重県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '24201',
        'name' => '津市',
      ),
      1 => 
      array (
        'id' => '24202',
        'name' => '四日市市',
      ),
      2 => 
      array (
        'id' => '24203',
        'name' => '伊勢市',
      ),
      3 => 
      array (
        'id' => '24204',
        'name' => '松阪市',
      ),
      4 => 
      array (
        'id' => '24205',
        'name' => '桑名市',
      ),
      5 => 
      array (
        'id' => '24207',
        'name' => '鈴鹿市',
      ),
      6 => 
      array (
        'id' => '24208',
        'name' => '名張市',
      ),
      7 => 
      array (
        'id' => '24209',
        'name' => '尾鷲市',
      ),
      8 => 
      array (
        'id' => '24210',
        'name' => '亀山市',
      ),
      9 => 
      array (
        'id' => '24211',
        'name' => '鳥羽市',
      ),
      10 => 
      array (
        'id' => '24212',
        'name' => '熊野市',
      ),
      11 => 
      array (
        'id' => '24214',
        'name' => 'いなべ市',
      ),
      12 => 
      array (
        'id' => '24215',
        'name' => '志摩市',
      ),
      13 => 
      array (
        'id' => '24216',
        'name' => '伊賀市',
      ),
      14 => 
      array (
        'id' => '24303',
        'name' => '木曽岬町',
      ),
      15 => 
      array (
        'id' => '24324',
        'name' => '東員町',
      ),
      16 => 
      array (
        'id' => '24341',
        'name' => '菰野町',
      ),
      17 => 
      array (
        'id' => '24343',
        'name' => '朝日町',
      ),
      18 => 
      array (
        'id' => '24344',
        'name' => '川越町',
      ),
      19 => 
      array (
        'id' => '24441',
        'name' => '多気町',
      ),
      20 => 
      array (
        'id' => '24442',
        'name' => '明和町',
      ),
      21 => 
      array (
        'id' => '24443',
        'name' => '大台町',
      ),
      22 => 
      array (
        'id' => '24461',
        'name' => '玉城町',
      ),
      23 => 
      array (
        'id' => '24470',
        'name' => '度会町',
      ),
      24 => 
      array (
        'id' => '24471',
        'name' => '大紀町',
      ),
      25 => 
      array (
        'id' => '24472',
        'name' => '南伊勢町',
      ),
      26 => 
      array (
        'id' => '24543',
        'name' => '紀北町',
      ),
      27 => 
      array (
        'id' => '24561',
        'name' => '御浜町',
      ),
      28 => 
      array (
        'id' => '24562',
        'name' => '紀宝町',
      ),
    ),
  ),
  24 => 
  array (
    'id' => '25',
    'pref' => '滋賀県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '25201',
        'name' => '大津市',
      ),
      1 => 
      array (
        'id' => '25202',
        'name' => '彦根市',
      ),
      2 => 
      array (
        'id' => '25203',
        'name' => '長浜市',
      ),
      3 => 
      array (
        'id' => '25204',
        'name' => '近江八幡市',
      ),
      4 => 
      array (
        'id' => '25206',
        'name' => '草津市',
      ),
      5 => 
      array (
        'id' => '25207',
        'name' => '守山市',
      ),
      6 => 
      array (
        'id' => '25208',
        'name' => '栗東市',
      ),
      7 => 
      array (
        'id' => '25209',
        'name' => '甲賀市',
      ),
      8 => 
      array (
        'id' => '25210',
        'name' => '野洲市',
      ),
      9 => 
      array (
        'id' => '25211',
        'name' => '湖南市',
      ),
      10 => 
      array (
        'id' => '25212',
        'name' => '高島市',
      ),
      11 => 
      array (
        'id' => '25213',
        'name' => '東近江市',
      ),
      12 => 
      array (
        'id' => '25214',
        'name' => '米原市',
      ),
      13 => 
      array (
        'id' => '25383',
        'name' => '日野町',
      ),
      14 => 
      array (
        'id' => '25384',
        'name' => '竜王町',
      ),
      15 => 
      array (
        'id' => '25425',
        'name' => '愛荘町',
      ),
      16 => 
      array (
        'id' => '25441',
        'name' => '豊郷町',
      ),
      17 => 
      array (
        'id' => '25442',
        'name' => '甲良町',
      ),
      18 => 
      array (
        'id' => '25443',
        'name' => '多賀町',
      ),
    ),
  ),
  25 => 
  array (
    'id' => '26',
    'pref' => '京都府',
    'city' => 
    array (
      0 => 
      array (
        'id' => '26100',
        'name' => '京都市',
      ),
      1 => 
      array (
        'id' => '26101',
        'name' => '北区',
      ),
      2 => 
      array (
        'id' => '26102',
        'name' => '上京区',
      ),
      3 => 
      array (
        'id' => '26103',
        'name' => '左京区',
      ),
      4 => 
      array (
        'id' => '26104',
        'name' => '中京区',
      ),
      5 => 
      array (
        'id' => '26105',
        'name' => '東山区',
      ),
      6 => 
      array (
        'id' => '26106',
        'name' => '下京区',
      ),
      7 => 
      array (
        'id' => '26107',
        'name' => '南区',
      ),
      8 => 
      array (
        'id' => '26108',
        'name' => '右京区',
      ),
      9 => 
      array (
        'id' => '26109',
        'name' => '伏見区',
      ),
      10 => 
      array (
        'id' => '26110',
        'name' => '山科区',
      ),
      11 => 
      array (
        'id' => '26111',
        'name' => '西京区',
      ),
      12 => 
      array (
        'id' => '26201',
        'name' => '福知山市',
      ),
      13 => 
      array (
        'id' => '26202',
        'name' => '舞鶴市',
      ),
      14 => 
      array (
        'id' => '26203',
        'name' => '綾部市',
      ),
      15 => 
      array (
        'id' => '26204',
        'name' => '宇治市',
      ),
      16 => 
      array (
        'id' => '26205',
        'name' => '宮津市',
      ),
      17 => 
      array (
        'id' => '26206',
        'name' => '亀岡市',
      ),
      18 => 
      array (
        'id' => '26207',
        'name' => '城陽市',
      ),
      19 => 
      array (
        'id' => '26208',
        'name' => '向日市',
      ),
      20 => 
      array (
        'id' => '26209',
        'name' => '長岡京市',
      ),
      21 => 
      array (
        'id' => '26210',
        'name' => '八幡市',
      ),
      22 => 
      array (
        'id' => '26211',
        'name' => '京田辺市',
      ),
      23 => 
      array (
        'id' => '26212',
        'name' => '京丹後市',
      ),
      24 => 
      array (
        'id' => '26213',
        'name' => '南丹市',
      ),
      25 => 
      array (
        'id' => '26214',
        'name' => '木津川市',
      ),
      26 => 
      array (
        'id' => '26303',
        'name' => '大山崎町',
      ),
      27 => 
      array (
        'id' => '26322',
        'name' => '久御山町',
      ),
      28 => 
      array (
        'id' => '26343',
        'name' => '井手町',
      ),
      29 => 
      array (
        'id' => '26344',
        'name' => '宇治田原町',
      ),
      30 => 
      array (
        'id' => '26364',
        'name' => '笠置町',
      ),
      31 => 
      array (
        'id' => '26365',
        'name' => '和束町',
      ),
      32 => 
      array (
        'id' => '26366',
        'name' => '精華町',
      ),
      33 => 
      array (
        'id' => '26367',
        'name' => '南山城村',
      ),
      34 => 
      array (
        'id' => '26407',
        'name' => '京丹波町',
      ),
      35 => 
      array (
        'id' => '26463',
        'name' => '伊根町',
      ),
      36 => 
      array (
        'id' => '26465',
        'name' => '与謝野町',
      ),
    ),
  ),
  26 => 
  array (
    'id' => '27',
    'pref' => '大阪府',
    'city' => 
    array (
      0 => 
      array (
        'id' => '27100',
        'name' => '大阪市',
      ),
      1 => 
      array (
        'id' => '27102',
        'name' => '都島区',
      ),
      2 => 
      array (
        'id' => '27103',
        'name' => '福島区',
      ),
      3 => 
      array (
        'id' => '27104',
        'name' => '此花区',
      ),
      4 => 
      array (
        'id' => '27106',
        'name' => '西区',
      ),
      5 => 
      array (
        'id' => '27107',
        'name' => '港区',
      ),
      6 => 
      array (
        'id' => '27108',
        'name' => '大正区',
      ),
      7 => 
      array (
        'id' => '27109',
        'name' => '天王寺区',
      ),
      8 => 
      array (
        'id' => '27111',
        'name' => '浪速区',
      ),
      9 => 
      array (
        'id' => '27113',
        'name' => '西淀川区',
      ),
      10 => 
      array (
        'id' => '27114',
        'name' => '東淀川区',
      ),
      11 => 
      array (
        'id' => '27115',
        'name' => '東成区',
      ),
      12 => 
      array (
        'id' => '27116',
        'name' => '生野区',
      ),
      13 => 
      array (
        'id' => '27117',
        'name' => '旭区',
      ),
      14 => 
      array (
        'id' => '27118',
        'name' => '城東区',
      ),
      15 => 
      array (
        'id' => '27119',
        'name' => '阿倍野区',
      ),
      16 => 
      array (
        'id' => '27120',
        'name' => '住吉区',
      ),
      17 => 
      array (
        'id' => '27121',
        'name' => '東住吉区',
      ),
      18 => 
      array (
        'id' => '27122',
        'name' => '西成区',
      ),
      19 => 
      array (
        'id' => '27123',
        'name' => '淀川区',
      ),
      20 => 
      array (
        'id' => '27124',
        'name' => '鶴見区',
      ),
      21 => 
      array (
        'id' => '27125',
        'name' => '住之江区',
      ),
      22 => 
      array (
        'id' => '27126',
        'name' => '平野区',
      ),
      23 => 
      array (
        'id' => '27127',
        'name' => '北区',
      ),
      24 => 
      array (
        'id' => '27128',
        'name' => '中央区',
      ),
      25 => 
      array (
        'id' => '27140',
        'name' => '堺市',
      ),
      26 => 
      array (
        'id' => '27141',
        'name' => '堺区',
      ),
      27 => 
      array (
        'id' => '27142',
        'name' => '中区',
      ),
      28 => 
      array (
        'id' => '27143',
        'name' => '東区',
      ),
      29 => 
      array (
        'id' => '27144',
        'name' => '西区',
      ),
      30 => 
      array (
        'id' => '27145',
        'name' => '南区',
      ),
      31 => 
      array (
        'id' => '27146',
        'name' => '北区',
      ),
      32 => 
      array (
        'id' => '27147',
        'name' => '美原区',
      ),
      33 => 
      array (
        'id' => '27202',
        'name' => '岸和田市',
      ),
      34 => 
      array (
        'id' => '27203',
        'name' => '豊中市',
      ),
      35 => 
      array (
        'id' => '27204',
        'name' => '池田市',
      ),
      36 => 
      array (
        'id' => '27205',
        'name' => '吹田市',
      ),
      37 => 
      array (
        'id' => '27206',
        'name' => '泉大津市',
      ),
      38 => 
      array (
        'id' => '27207',
        'name' => '高槻市',
      ),
      39 => 
      array (
        'id' => '27208',
        'name' => '貝塚市',
      ),
      40 => 
      array (
        'id' => '27209',
        'name' => '守口市',
      ),
      41 => 
      array (
        'id' => '27210',
        'name' => '枚方市',
      ),
      42 => 
      array (
        'id' => '27211',
        'name' => '茨木市',
      ),
      43 => 
      array (
        'id' => '27212',
        'name' => '八尾市',
      ),
      44 => 
      array (
        'id' => '27213',
        'name' => '泉佐野市',
      ),
      45 => 
      array (
        'id' => '27214',
        'name' => '富田林市',
      ),
      46 => 
      array (
        'id' => '27215',
        'name' => '寝屋川市',
      ),
      47 => 
      array (
        'id' => '27216',
        'name' => '河内長野市',
      ),
      48 => 
      array (
        'id' => '27217',
        'name' => '松原市',
      ),
      49 => 
      array (
        'id' => '27218',
        'name' => '大東市',
      ),
      50 => 
      array (
        'id' => '27219',
        'name' => '和泉市',
      ),
      51 => 
      array (
        'id' => '27220',
        'name' => '箕面市',
      ),
      52 => 
      array (
        'id' => '27221',
        'name' => '柏原市',
      ),
      53 => 
      array (
        'id' => '27222',
        'name' => '羽曳野市',
      ),
      54 => 
      array (
        'id' => '27223',
        'name' => '門真市',
      ),
      55 => 
      array (
        'id' => '27224',
        'name' => '摂津市',
      ),
      56 => 
      array (
        'id' => '27225',
        'name' => '高石市',
      ),
      57 => 
      array (
        'id' => '27226',
        'name' => '藤井寺市',
      ),
      58 => 
      array (
        'id' => '27227',
        'name' => '東大阪市',
      ),
      59 => 
      array (
        'id' => '27228',
        'name' => '泉南市',
      ),
      60 => 
      array (
        'id' => '27229',
        'name' => '四條畷市',
      ),
      61 => 
      array (
        'id' => '27230',
        'name' => '交野市',
      ),
      62 => 
      array (
        'id' => '27231',
        'name' => '大阪狭山市',
      ),
      63 => 
      array (
        'id' => '27232',
        'name' => '阪南市',
      ),
      64 => 
      array (
        'id' => '27301',
        'name' => '島本町',
      ),
      65 => 
      array (
        'id' => '27321',
        'name' => '豊能町',
      ),
      66 => 
      array (
        'id' => '27322',
        'name' => '能勢町',
      ),
      67 => 
      array (
        'id' => '27341',
        'name' => '忠岡町',
      ),
      68 => 
      array (
        'id' => '27361',
        'name' => '熊取町',
      ),
      69 => 
      array (
        'id' => '27362',
        'name' => '田尻町',
      ),
      70 => 
      array (
        'id' => '27366',
        'name' => '岬町',
      ),
      71 => 
      array (
        'id' => '27381',
        'name' => '太子町',
      ),
      72 => 
      array (
        'id' => '27382',
        'name' => '河南町',
      ),
      73 => 
      array (
        'id' => '27383',
        'name' => '千早赤阪村',
      ),
    ),
  ),
  27 => 
  array (
    'id' => '28',
    'pref' => '兵庫県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '28100',
        'name' => '神戸市',
      ),
      1 => 
      array (
        'id' => '28101',
        'name' => '東灘区',
      ),
      2 => 
      array (
        'id' => '28102',
        'name' => '灘区',
      ),
      3 => 
      array (
        'id' => '28105',
        'name' => '兵庫区',
      ),
      4 => 
      array (
        'id' => '28106',
        'name' => '長田区',
      ),
      5 => 
      array (
        'id' => '28107',
        'name' => '須磨区',
      ),
      6 => 
      array (
        'id' => '28108',
        'name' => '垂水区',
      ),
      7 => 
      array (
        'id' => '28109',
        'name' => '北区',
      ),
      8 => 
      array (
        'id' => '28110',
        'name' => '中央区',
      ),
      9 => 
      array (
        'id' => '28111',
        'name' => '西区',
      ),
      10 => 
      array (
        'id' => '28201',
        'name' => '姫路市',
      ),
      11 => 
      array (
        'id' => '28202',
        'name' => '尼崎市',
      ),
      12 => 
      array (
        'id' => '28203',
        'name' => '明石市',
      ),
      13 => 
      array (
        'id' => '28204',
        'name' => '西宮市',
      ),
      14 => 
      array (
        'id' => '28205',
        'name' => '洲本市',
      ),
      15 => 
      array (
        'id' => '28206',
        'name' => '芦屋市',
      ),
      16 => 
      array (
        'id' => '28207',
        'name' => '伊丹市',
      ),
      17 => 
      array (
        'id' => '28208',
        'name' => '相生市',
      ),
      18 => 
      array (
        'id' => '28209',
        'name' => '豊岡市',
      ),
      19 => 
      array (
        'id' => '28210',
        'name' => '加古川市',
      ),
      20 => 
      array (
        'id' => '28212',
        'name' => '赤穂市',
      ),
      21 => 
      array (
        'id' => '28213',
        'name' => '西脇市',
      ),
      22 => 
      array (
        'id' => '28214',
        'name' => '宝塚市',
      ),
      23 => 
      array (
        'id' => '28215',
        'name' => '三木市',
      ),
      24 => 
      array (
        'id' => '28216',
        'name' => '高砂市',
      ),
      25 => 
      array (
        'id' => '28217',
        'name' => '川西市',
      ),
      26 => 
      array (
        'id' => '28218',
        'name' => '小野市',
      ),
      27 => 
      array (
        'id' => '28219',
        'name' => '三田市',
      ),
      28 => 
      array (
        'id' => '28220',
        'name' => '加西市',
      ),
      29 => 
      array (
        'id' => '28221',
        'name' => '丹波篠山市',
      ),
      30 => 
      array (
        'id' => '28222',
        'name' => '養父市',
      ),
      31 => 
      array (
        'id' => '28223',
        'name' => '丹波市',
      ),
      32 => 
      array (
        'id' => '28224',
        'name' => '南あわじ市',
      ),
      33 => 
      array (
        'id' => '28225',
        'name' => '朝来市',
      ),
      34 => 
      array (
        'id' => '28226',
        'name' => '淡路市',
      ),
      35 => 
      array (
        'id' => '28227',
        'name' => '宍粟市',
      ),
      36 => 
      array (
        'id' => '28228',
        'name' => '加東市',
      ),
      37 => 
      array (
        'id' => '28229',
        'name' => 'たつの市',
      ),
      38 => 
      array (
        'id' => '28301',
        'name' => '猪名川町',
      ),
      39 => 
      array (
        'id' => '28365',
        'name' => '多可町',
      ),
      40 => 
      array (
        'id' => '28381',
        'name' => '稲美町',
      ),
      41 => 
      array (
        'id' => '28382',
        'name' => '播磨町',
      ),
      42 => 
      array (
        'id' => '28442',
        'name' => '市川町',
      ),
      43 => 
      array (
        'id' => '28443',
        'name' => '福崎町',
      ),
      44 => 
      array (
        'id' => '28446',
        'name' => '神河町',
      ),
      45 => 
      array (
        'id' => '28464',
        'name' => '太子町',
      ),
      46 => 
      array (
        'id' => '28481',
        'name' => '上郡町',
      ),
      47 => 
      array (
        'id' => '28501',
        'name' => '佐用町',
      ),
      48 => 
      array (
        'id' => '28585',
        'name' => '香美町',
      ),
      49 => 
      array (
        'id' => '28586',
        'name' => '新温泉町',
      ),
    ),
  ),
  28 => 
  array (
    'id' => '29',
    'pref' => '奈良県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '29201',
        'name' => '奈良市',
      ),
      1 => 
      array (
        'id' => '29202',
        'name' => '大和高田市',
      ),
      2 => 
      array (
        'id' => '29203',
        'name' => '大和郡山市',
      ),
      3 => 
      array (
        'id' => '29204',
        'name' => '天理市',
      ),
      4 => 
      array (
        'id' => '29205',
        'name' => '橿原市',
      ),
      5 => 
      array (
        'id' => '29206',
        'name' => '桜井市',
      ),
      6 => 
      array (
        'id' => '29207',
        'name' => '五條市',
      ),
      7 => 
      array (
        'id' => '29208',
        'name' => '御所市',
      ),
      8 => 
      array (
        'id' => '29209',
        'name' => '生駒市',
      ),
      9 => 
      array (
        'id' => '29210',
        'name' => '香芝市',
      ),
      10 => 
      array (
        'id' => '29211',
        'name' => '葛城市',
      ),
      11 => 
      array (
        'id' => '29212',
        'name' => '宇陀市',
      ),
      12 => 
      array (
        'id' => '29322',
        'name' => '山添村',
      ),
      13 => 
      array (
        'id' => '29342',
        'name' => '平群町',
      ),
      14 => 
      array (
        'id' => '29343',
        'name' => '三郷町',
      ),
      15 => 
      array (
        'id' => '29344',
        'name' => '斑鳩町',
      ),
      16 => 
      array (
        'id' => '29345',
        'name' => '安堵町',
      ),
      17 => 
      array (
        'id' => '29361',
        'name' => '川西町',
      ),
      18 => 
      array (
        'id' => '29362',
        'name' => '三宅町',
      ),
      19 => 
      array (
        'id' => '29363',
        'name' => '田原本町',
      ),
      20 => 
      array (
        'id' => '29385',
        'name' => '曽爾村',
      ),
      21 => 
      array (
        'id' => '29386',
        'name' => '御杖村',
      ),
      22 => 
      array (
        'id' => '29401',
        'name' => '高取町',
      ),
      23 => 
      array (
        'id' => '29402',
        'name' => '明日香村',
      ),
      24 => 
      array (
        'id' => '29424',
        'name' => '上牧町',
      ),
      25 => 
      array (
        'id' => '29425',
        'name' => '王寺町',
      ),
      26 => 
      array (
        'id' => '29426',
        'name' => '広陵町',
      ),
      27 => 
      array (
        'id' => '29427',
        'name' => '河合町',
      ),
      28 => 
      array (
        'id' => '29441',
        'name' => '吉野町',
      ),
      29 => 
      array (
        'id' => '29442',
        'name' => '大淀町',
      ),
      30 => 
      array (
        'id' => '29443',
        'name' => '下市町',
      ),
      31 => 
      array (
        'id' => '29444',
        'name' => '黒滝村',
      ),
      32 => 
      array (
        'id' => '29446',
        'name' => '天川村',
      ),
      33 => 
      array (
        'id' => '29447',
        'name' => '野迫川村',
      ),
      34 => 
      array (
        'id' => '29449',
        'name' => '十津川村',
      ),
      35 => 
      array (
        'id' => '29450',
        'name' => '下北山村',
      ),
      36 => 
      array (
        'id' => '29451',
        'name' => '上北山村',
      ),
      37 => 
      array (
        'id' => '29452',
        'name' => '川上村',
      ),
      38 => 
      array (
        'id' => '29453',
        'name' => '東吉野村',
      ),
    ),
  ),
  29 => 
  array (
    'id' => '30',
    'pref' => '和歌山県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '30201',
        'name' => '和歌山市',
      ),
      1 => 
      array (
        'id' => '30202',
        'name' => '海南市',
      ),
      2 => 
      array (
        'id' => '30203',
        'name' => '橋本市',
      ),
      3 => 
      array (
        'id' => '30204',
        'name' => '有田市',
      ),
      4 => 
      array (
        'id' => '30205',
        'name' => '御坊市',
      ),
      5 => 
      array (
        'id' => '30206',
        'name' => '田辺市',
      ),
      6 => 
      array (
        'id' => '30207',
        'name' => '新宮市',
      ),
      7 => 
      array (
        'id' => '30208',
        'name' => '紀の川市',
      ),
      8 => 
      array (
        'id' => '30209',
        'name' => '岩出市',
      ),
      9 => 
      array (
        'id' => '30304',
        'name' => '紀美野町',
      ),
      10 => 
      array (
        'id' => '30341',
        'name' => 'かつらぎ町',
      ),
      11 => 
      array (
        'id' => '30343',
        'name' => '九度山町',
      ),
      12 => 
      array (
        'id' => '30344',
        'name' => '高野町',
      ),
      13 => 
      array (
        'id' => '30361',
        'name' => '湯浅町',
      ),
      14 => 
      array (
        'id' => '30362',
        'name' => '広川町',
      ),
      15 => 
      array (
        'id' => '30366',
        'name' => '有田川町',
      ),
      16 => 
      array (
        'id' => '30381',
        'name' => '美浜町',
      ),
      17 => 
      array (
        'id' => '30382',
        'name' => '日高町',
      ),
      18 => 
      array (
        'id' => '30383',
        'name' => '由良町',
      ),
      19 => 
      array (
        'id' => '30390',
        'name' => '印南町',
      ),
      20 => 
      array (
        'id' => '30391',
        'name' => 'みなべ町',
      ),
      21 => 
      array (
        'id' => '30392',
        'name' => '日高川町',
      ),
      22 => 
      array (
        'id' => '30401',
        'name' => '白浜町',
      ),
      23 => 
      array (
        'id' => '30404',
        'name' => '上富田町',
      ),
      24 => 
      array (
        'id' => '30406',
        'name' => 'すさみ町',
      ),
      25 => 
      array (
        'id' => '30421',
        'name' => '那智勝浦町',
      ),
      26 => 
      array (
        'id' => '30422',
        'name' => '太地町',
      ),
      27 => 
      array (
        'id' => '30424',
        'name' => '古座川町',
      ),
      28 => 
      array (
        'id' => '30427',
        'name' => '北山村',
      ),
      29 => 
      array (
        'id' => '30428',
        'name' => '串本町',
      ),
    ),
  ),
  30 => 
  array (
    'id' => '31',
    'pref' => '鳥取県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '31201',
        'name' => '鳥取市',
      ),
      1 => 
      array (
        'id' => '31202',
        'name' => '米子市',
      ),
      2 => 
      array (
        'id' => '31203',
        'name' => '倉吉市',
      ),
      3 => 
      array (
        'id' => '31204',
        'name' => '境港市',
      ),
      4 => 
      array (
        'id' => '31302',
        'name' => '岩美町',
      ),
      5 => 
      array (
        'id' => '31325',
        'name' => '若桜町',
      ),
      6 => 
      array (
        'id' => '31328',
        'name' => '智頭町',
      ),
      7 => 
      array (
        'id' => '31329',
        'name' => '八頭町',
      ),
      8 => 
      array (
        'id' => '31364',
        'name' => '三朝町',
      ),
      9 => 
      array (
        'id' => '31370',
        'name' => '湯梨浜町',
      ),
      10 => 
      array (
        'id' => '31371',
        'name' => '琴浦町',
      ),
      11 => 
      array (
        'id' => '31372',
        'name' => '北栄町',
      ),
      12 => 
      array (
        'id' => '31384',
        'name' => '日吉津村',
      ),
      13 => 
      array (
        'id' => '31386',
        'name' => '大山町',
      ),
      14 => 
      array (
        'id' => '31389',
        'name' => '南部町',
      ),
      15 => 
      array (
        'id' => '31390',
        'name' => '伯耆町',
      ),
      16 => 
      array (
        'id' => '31401',
        'name' => '日南町',
      ),
      17 => 
      array (
        'id' => '31402',
        'name' => '日野町',
      ),
      18 => 
      array (
        'id' => '31403',
        'name' => '江府町',
      ),
    ),
  ),
  31 => 
  array (
    'id' => '32',
    'pref' => '島根県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '32201',
        'name' => '松江市',
      ),
      1 => 
      array (
        'id' => '32202',
        'name' => '浜田市',
      ),
      2 => 
      array (
        'id' => '32203',
        'name' => '出雲市',
      ),
      3 => 
      array (
        'id' => '32204',
        'name' => '益田市',
      ),
      4 => 
      array (
        'id' => '32205',
        'name' => '大田市',
      ),
      5 => 
      array (
        'id' => '32206',
        'name' => '安来市',
      ),
      6 => 
      array (
        'id' => '32207',
        'name' => '江津市',
      ),
      7 => 
      array (
        'id' => '32209',
        'name' => '雲南市',
      ),
      8 => 
      array (
        'id' => '32343',
        'name' => '奥出雲町',
      ),
      9 => 
      array (
        'id' => '32386',
        'name' => '飯南町',
      ),
      10 => 
      array (
        'id' => '32441',
        'name' => '川本町',
      ),
      11 => 
      array (
        'id' => '32448',
        'name' => '美郷町',
      ),
      12 => 
      array (
        'id' => '32449',
        'name' => '邑南町',
      ),
      13 => 
      array (
        'id' => '32501',
        'name' => '津和野町',
      ),
      14 => 
      array (
        'id' => '32505',
        'name' => '吉賀町',
      ),
      15 => 
      array (
        'id' => '32525',
        'name' => '海士町',
      ),
      16 => 
      array (
        'id' => '32526',
        'name' => '西ノ島町',
      ),
      17 => 
      array (
        'id' => '32527',
        'name' => '知夫村',
      ),
      18 => 
      array (
        'id' => '32528',
        'name' => '隠岐の島町',
      ),
    ),
  ),
  32 => 
  array (
    'id' => '33',
    'pref' => '岡山県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '33100',
        'name' => '岡山市',
      ),
      1 => 
      array (
        'id' => '33101',
        'name' => '北区',
      ),
      2 => 
      array (
        'id' => '33102',
        'name' => '中区',
      ),
      3 => 
      array (
        'id' => '33103',
        'name' => '東区',
      ),
      4 => 
      array (
        'id' => '33104',
        'name' => '南区',
      ),
      5 => 
      array (
        'id' => '33202',
        'name' => '倉敷市',
      ),
      6 => 
      array (
        'id' => '33203',
        'name' => '津山市',
      ),
      7 => 
      array (
        'id' => '33204',
        'name' => '玉野市',
      ),
      8 => 
      array (
        'id' => '33205',
        'name' => '笠岡市',
      ),
      9 => 
      array (
        'id' => '33207',
        'name' => '井原市',
      ),
      10 => 
      array (
        'id' => '33208',
        'name' => '総社市',
      ),
      11 => 
      array (
        'id' => '33209',
        'name' => '高梁市',
      ),
      12 => 
      array (
        'id' => '33210',
        'name' => '新見市',
      ),
      13 => 
      array (
        'id' => '33211',
        'name' => '備前市',
      ),
      14 => 
      array (
        'id' => '33212',
        'name' => '瀬戸内市',
      ),
      15 => 
      array (
        'id' => '33213',
        'name' => '赤磐市',
      ),
      16 => 
      array (
        'id' => '33214',
        'name' => '真庭市',
      ),
      17 => 
      array (
        'id' => '33215',
        'name' => '美作市',
      ),
      18 => 
      array (
        'id' => '33216',
        'name' => '浅口市',
      ),
      19 => 
      array (
        'id' => '33346',
        'name' => '和気町',
      ),
      20 => 
      array (
        'id' => '33423',
        'name' => '早島町',
      ),
      21 => 
      array (
        'id' => '33445',
        'name' => '里庄町',
      ),
      22 => 
      array (
        'id' => '33461',
        'name' => '矢掛町',
      ),
      23 => 
      array (
        'id' => '33586',
        'name' => '新庄村',
      ),
      24 => 
      array (
        'id' => '33606',
        'name' => '鏡野町',
      ),
      25 => 
      array (
        'id' => '33622',
        'name' => '勝央町',
      ),
      26 => 
      array (
        'id' => '33623',
        'name' => '奈義町',
      ),
      27 => 
      array (
        'id' => '33643',
        'name' => '西粟倉村',
      ),
      28 => 
      array (
        'id' => '33663',
        'name' => '久米南町',
      ),
      29 => 
      array (
        'id' => '33666',
        'name' => '美咲町',
      ),
      30 => 
      array (
        'id' => '33681',
        'name' => '吉備中央町',
      ),
    ),
  ),
  33 => 
  array (
    'id' => '34',
    'pref' => '広島県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '34100',
        'name' => '広島市',
      ),
      1 => 
      array (
        'id' => '34101',
        'name' => '中区',
      ),
      2 => 
      array (
        'id' => '34102',
        'name' => '東区',
      ),
      3 => 
      array (
        'id' => '34103',
        'name' => '南区',
      ),
      4 => 
      array (
        'id' => '34104',
        'name' => '西区',
      ),
      5 => 
      array (
        'id' => '34105',
        'name' => '安佐南区',
      ),
      6 => 
      array (
        'id' => '34106',
        'name' => '安佐北区',
      ),
      7 => 
      array (
        'id' => '34107',
        'name' => '安芸区',
      ),
      8 => 
      array (
        'id' => '34108',
        'name' => '佐伯区',
      ),
      9 => 
      array (
        'id' => '34202',
        'name' => '呉市',
      ),
      10 => 
      array (
        'id' => '34203',
        'name' => '竹原市',
      ),
      11 => 
      array (
        'id' => '34204',
        'name' => '三原市',
      ),
      12 => 
      array (
        'id' => '34205',
        'name' => '尾道市',
      ),
      13 => 
      array (
        'id' => '34207',
        'name' => '福山市',
      ),
      14 => 
      array (
        'id' => '34208',
        'name' => '府中市',
      ),
      15 => 
      array (
        'id' => '34209',
        'name' => '三次市',
      ),
      16 => 
      array (
        'id' => '34210',
        'name' => '庄原市',
      ),
      17 => 
      array (
        'id' => '34211',
        'name' => '大竹市',
      ),
      18 => 
      array (
        'id' => '34212',
        'name' => '東広島市',
      ),
      19 => 
      array (
        'id' => '34213',
        'name' => '廿日市市',
      ),
      20 => 
      array (
        'id' => '34214',
        'name' => '安芸高田市',
      ),
      21 => 
      array (
        'id' => '34215',
        'name' => '江田島市',
      ),
      22 => 
      array (
        'id' => '34302',
        'name' => '府中町',
      ),
      23 => 
      array (
        'id' => '34304',
        'name' => '海田町',
      ),
      24 => 
      array (
        'id' => '34307',
        'name' => '熊野町',
      ),
      25 => 
      array (
        'id' => '34309',
        'name' => '坂町',
      ),
      26 => 
      array (
        'id' => '34368',
        'name' => '安芸太田町',
      ),
      27 => 
      array (
        'id' => '34369',
        'name' => '北広島町',
      ),
      28 => 
      array (
        'id' => '34431',
        'name' => '大崎上島町',
      ),
      29 => 
      array (
        'id' => '34462',
        'name' => '世羅町',
      ),
      30 => 
      array (
        'id' => '34545',
        'name' => '神石高原町',
      ),
    ),
  ),
  34 => 
  array (
    'id' => '35',
    'pref' => '山口県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '35201',
        'name' => '下関市',
      ),
      1 => 
      array (
        'id' => '35202',
        'name' => '宇部市',
      ),
      2 => 
      array (
        'id' => '35203',
        'name' => '山口市',
      ),
      3 => 
      array (
        'id' => '35204',
        'name' => '萩市',
      ),
      4 => 
      array (
        'id' => '35206',
        'name' => '防府市',
      ),
      5 => 
      array (
        'id' => '35207',
        'name' => '下松市',
      ),
      6 => 
      array (
        'id' => '35208',
        'name' => '岩国市',
      ),
      7 => 
      array (
        'id' => '35210',
        'name' => '光市',
      ),
      8 => 
      array (
        'id' => '35211',
        'name' => '長門市',
      ),
      9 => 
      array (
        'id' => '35212',
        'name' => '柳井市',
      ),
      10 => 
      array (
        'id' => '35213',
        'name' => '美祢市',
      ),
      11 => 
      array (
        'id' => '35215',
        'name' => '周南市',
      ),
      12 => 
      array (
        'id' => '35216',
        'name' => '山陽小野田市',
      ),
      13 => 
      array (
        'id' => '35305',
        'name' => '周防大島町',
      ),
      14 => 
      array (
        'id' => '35321',
        'name' => '和木町',
      ),
      15 => 
      array (
        'id' => '35341',
        'name' => '上関町',
      ),
      16 => 
      array (
        'id' => '35343',
        'name' => '田布施町',
      ),
      17 => 
      array (
        'id' => '35344',
        'name' => '平生町',
      ),
      18 => 
      array (
        'id' => '35502',
        'name' => '阿武町',
      ),
    ),
  ),
  35 => 
  array (
    'id' => '36',
    'pref' => '徳島県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '36201',
        'name' => '徳島市',
      ),
      1 => 
      array (
        'id' => '36202',
        'name' => '鳴門市',
      ),
      2 => 
      array (
        'id' => '36203',
        'name' => '小松島市',
      ),
      3 => 
      array (
        'id' => '36204',
        'name' => '阿南市',
      ),
      4 => 
      array (
        'id' => '36205',
        'name' => '吉野川市',
      ),
      5 => 
      array (
        'id' => '36206',
        'name' => '阿波市',
      ),
      6 => 
      array (
        'id' => '36207',
        'name' => '美馬市',
      ),
      7 => 
      array (
        'id' => '36208',
        'name' => '三好市',
      ),
      8 => 
      array (
        'id' => '36301',
        'name' => '勝浦町',
      ),
      9 => 
      array (
        'id' => '36302',
        'name' => '上勝町',
      ),
      10 => 
      array (
        'id' => '36321',
        'name' => '佐那河内村',
      ),
      11 => 
      array (
        'id' => '36341',
        'name' => '石井町',
      ),
      12 => 
      array (
        'id' => '36342',
        'name' => '神山町',
      ),
      13 => 
      array (
        'id' => '36368',
        'name' => '那賀町',
      ),
      14 => 
      array (
        'id' => '36383',
        'name' => '牟岐町',
      ),
      15 => 
      array (
        'id' => '36387',
        'name' => '美波町',
      ),
      16 => 
      array (
        'id' => '36388',
        'name' => '海陽町',
      ),
      17 => 
      array (
        'id' => '36401',
        'name' => '松茂町',
      ),
      18 => 
      array (
        'id' => '36402',
        'name' => '北島町',
      ),
      19 => 
      array (
        'id' => '36403',
        'name' => '藍住町',
      ),
      20 => 
      array (
        'id' => '36404',
        'name' => '板野町',
      ),
      21 => 
      array (
        'id' => '36405',
        'name' => '上板町',
      ),
      22 => 
      array (
        'id' => '36468',
        'name' => 'つるぎ町',
      ),
      23 => 
      array (
        'id' => '36489',
        'name' => '東みよし町',
      ),
    ),
  ),
  36 => 
  array (
    'id' => '37',
    'pref' => '香川県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '37201',
        'name' => '高松市',
      ),
      1 => 
      array (
        'id' => '37202',
        'name' => '丸亀市',
      ),
      2 => 
      array (
        'id' => '37203',
        'name' => '坂出市',
      ),
      3 => 
      array (
        'id' => '37204',
        'name' => '善通寺市',
      ),
      4 => 
      array (
        'id' => '37205',
        'name' => '観音寺市',
      ),
      5 => 
      array (
        'id' => '37206',
        'name' => 'さぬき市',
      ),
      6 => 
      array (
        'id' => '37207',
        'name' => '東かがわ市',
      ),
      7 => 
      array (
        'id' => '37208',
        'name' => '三豊市',
      ),
      8 => 
      array (
        'id' => '37322',
        'name' => '土庄町',
      ),
      9 => 
      array (
        'id' => '37324',
        'name' => '小豆島町',
      ),
      10 => 
      array (
        'id' => '37341',
        'name' => '三木町',
      ),
      11 => 
      array (
        'id' => '37364',
        'name' => '直島町',
      ),
      12 => 
      array (
        'id' => '37386',
        'name' => '宇多津町',
      ),
      13 => 
      array (
        'id' => '37387',
        'name' => '綾川町',
      ),
      14 => 
      array (
        'id' => '37403',
        'name' => '琴平町',
      ),
      15 => 
      array (
        'id' => '37404',
        'name' => '多度津町',
      ),
      16 => 
      array (
        'id' => '37406',
        'name' => 'まんのう町',
      ),
    ),
  ),
  37 => 
  array (
    'id' => '38',
    'pref' => '愛媛県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '38201',
        'name' => '松山市',
      ),
      1 => 
      array (
        'id' => '38202',
        'name' => '今治市',
      ),
      2 => 
      array (
        'id' => '38203',
        'name' => '宇和島市',
      ),
      3 => 
      array (
        'id' => '38204',
        'name' => '八幡浜市',
      ),
      4 => 
      array (
        'id' => '38205',
        'name' => '新居浜市',
      ),
      5 => 
      array (
        'id' => '38206',
        'name' => '西条市',
      ),
      6 => 
      array (
        'id' => '38207',
        'name' => '大洲市',
      ),
      7 => 
      array (
        'id' => '38210',
        'name' => '伊予市',
      ),
      8 => 
      array (
        'id' => '38213',
        'name' => '四国中央市',
      ),
      9 => 
      array (
        'id' => '38214',
        'name' => '西予市',
      ),
      10 => 
      array (
        'id' => '38215',
        'name' => '東温市',
      ),
      11 => 
      array (
        'id' => '38356',
        'name' => '上島町',
      ),
      12 => 
      array (
        'id' => '38386',
        'name' => '久万高原町',
      ),
      13 => 
      array (
        'id' => '38401',
        'name' => '松前町',
      ),
      14 => 
      array (
        'id' => '38402',
        'name' => '砥部町',
      ),
      15 => 
      array (
        'id' => '38422',
        'name' => '内子町',
      ),
      16 => 
      array (
        'id' => '38442',
        'name' => '伊方町',
      ),
      17 => 
      array (
        'id' => '38484',
        'name' => '松野町',
      ),
      18 => 
      array (
        'id' => '38488',
        'name' => '鬼北町',
      ),
      19 => 
      array (
        'id' => '38506',
        'name' => '愛南町',
      ),
    ),
  ),
  38 => 
  array (
    'id' => '39',
    'pref' => '高知県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '39201',
        'name' => '高知市',
      ),
      1 => 
      array (
        'id' => '39202',
        'name' => '室戸市',
      ),
      2 => 
      array (
        'id' => '39203',
        'name' => '安芸市',
      ),
      3 => 
      array (
        'id' => '39204',
        'name' => '南国市',
      ),
      4 => 
      array (
        'id' => '39205',
        'name' => '土佐市',
      ),
      5 => 
      array (
        'id' => '39206',
        'name' => '須崎市',
      ),
      6 => 
      array (
        'id' => '39208',
        'name' => '宿毛市',
      ),
      7 => 
      array (
        'id' => '39209',
        'name' => '土佐清水市',
      ),
      8 => 
      array (
        'id' => '39210',
        'name' => '四万十市',
      ),
      9 => 
      array (
        'id' => '39211',
        'name' => '香南市',
      ),
      10 => 
      array (
        'id' => '39212',
        'name' => '香美市',
      ),
      11 => 
      array (
        'id' => '39301',
        'name' => '東洋町',
      ),
      12 => 
      array (
        'id' => '39302',
        'name' => '奈半利町',
      ),
      13 => 
      array (
        'id' => '39303',
        'name' => '田野町',
      ),
      14 => 
      array (
        'id' => '39304',
        'name' => '安田町',
      ),
      15 => 
      array (
        'id' => '39305',
        'name' => '北川村',
      ),
      16 => 
      array (
        'id' => '39306',
        'name' => '馬路村',
      ),
      17 => 
      array (
        'id' => '39307',
        'name' => '芸西村',
      ),
      18 => 
      array (
        'id' => '39341',
        'name' => '本山町',
      ),
      19 => 
      array (
        'id' => '39344',
        'name' => '大豊町',
      ),
      20 => 
      array (
        'id' => '39363',
        'name' => '土佐町',
      ),
      21 => 
      array (
        'id' => '39364',
        'name' => '大川村',
      ),
      22 => 
      array (
        'id' => '39386',
        'name' => 'いの町',
      ),
      23 => 
      array (
        'id' => '39387',
        'name' => '仁淀川町',
      ),
      24 => 
      array (
        'id' => '39401',
        'name' => '中土佐町',
      ),
      25 => 
      array (
        'id' => '39402',
        'name' => '佐川町',
      ),
      26 => 
      array (
        'id' => '39403',
        'name' => '越知町',
      ),
      27 => 
      array (
        'id' => '39405',
        'name' => '檮原町',
      ),
      28 => 
      array (
        'id' => '39410',
        'name' => '日高村',
      ),
      29 => 
      array (
        'id' => '39411',
        'name' => '津野町',
      ),
      30 => 
      array (
        'id' => '39412',
        'name' => '四万十町',
      ),
      31 => 
      array (
        'id' => '39424',
        'name' => '大月町',
      ),
      32 => 
      array (
        'id' => '39427',
        'name' => '三原村',
      ),
      33 => 
      array (
        'id' => '39428',
        'name' => '黒潮町',
      ),
    ),
  ),
  39 => 
  array (
    'id' => '40',
    'pref' => '福岡県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '40100',
        'name' => '北九州市',
      ),
      1 => 
      array (
        'id' => '40101',
        'name' => '門司区',
      ),
      2 => 
      array (
        'id' => '40103',
        'name' => '若松区',
      ),
      3 => 
      array (
        'id' => '40105',
        'name' => '戸畑区',
      ),
      4 => 
      array (
        'id' => '40106',
        'name' => '小倉北区',
      ),
      5 => 
      array (
        'id' => '40107',
        'name' => '小倉南区',
      ),
      6 => 
      array (
        'id' => '40108',
        'name' => '八幡東区',
      ),
      7 => 
      array (
        'id' => '40109',
        'name' => '八幡西区',
      ),
      8 => 
      array (
        'id' => '40130',
        'name' => '福岡市',
      ),
      9 => 
      array (
        'id' => '40131',
        'name' => '東区',
      ),
      10 => 
      array (
        'id' => '40132',
        'name' => '博多区',
      ),
      11 => 
      array (
        'id' => '40133',
        'name' => '中央区',
      ),
      12 => 
      array (
        'id' => '40134',
        'name' => '南区',
      ),
      13 => 
      array (
        'id' => '40135',
        'name' => '西区',
      ),
      14 => 
      array (
        'id' => '40136',
        'name' => '城南区',
      ),
      15 => 
      array (
        'id' => '40137',
        'name' => '早良区',
      ),
      16 => 
      array (
        'id' => '40202',
        'name' => '大牟田市',
      ),
      17 => 
      array (
        'id' => '40203',
        'name' => '久留米市',
      ),
      18 => 
      array (
        'id' => '40204',
        'name' => '直方市',
      ),
      19 => 
      array (
        'id' => '40205',
        'name' => '飯塚市',
      ),
      20 => 
      array (
        'id' => '40206',
        'name' => '田川市',
      ),
      21 => 
      array (
        'id' => '40207',
        'name' => '柳川市',
      ),
      22 => 
      array (
        'id' => '40210',
        'name' => '八女市',
      ),
      23 => 
      array (
        'id' => '40211',
        'name' => '筑後市',
      ),
      24 => 
      array (
        'id' => '40212',
        'name' => '大川市',
      ),
      25 => 
      array (
        'id' => '40213',
        'name' => '行橋市',
      ),
      26 => 
      array (
        'id' => '40214',
        'name' => '豊前市',
      ),
      27 => 
      array (
        'id' => '40215',
        'name' => '中間市',
      ),
      28 => 
      array (
        'id' => '40216',
        'name' => '小郡市',
      ),
      29 => 
      array (
        'id' => '40217',
        'name' => '筑紫野市',
      ),
      30 => 
      array (
        'id' => '40218',
        'name' => '春日市',
      ),
      31 => 
      array (
        'id' => '40219',
        'name' => '大野城市',
      ),
      32 => 
      array (
        'id' => '40220',
        'name' => '宗像市',
      ),
      33 => 
      array (
        'id' => '40221',
        'name' => '太宰府市',
      ),
      34 => 
      array (
        'id' => '40223',
        'name' => '古賀市',
      ),
      35 => 
      array (
        'id' => '40224',
        'name' => '福津市',
      ),
      36 => 
      array (
        'id' => '40225',
        'name' => 'うきは市',
      ),
      37 => 
      array (
        'id' => '40226',
        'name' => '宮若市',
      ),
      38 => 
      array (
        'id' => '40227',
        'name' => '嘉麻市',
      ),
      39 => 
      array (
        'id' => '40228',
        'name' => '朝倉市',
      ),
      40 => 
      array (
        'id' => '40229',
        'name' => 'みやま市',
      ),
      41 => 
      array (
        'id' => '40230',
        'name' => '糸島市',
      ),
      42 => 
      array (
        'id' => '40231',
        'name' => '那珂川市',
      ),
      43 => 
      array (
        'id' => '40341',
        'name' => '宇美町',
      ),
      44 => 
      array (
        'id' => '40342',
        'name' => '篠栗町',
      ),
      45 => 
      array (
        'id' => '40343',
        'name' => '志免町',
      ),
      46 => 
      array (
        'id' => '40344',
        'name' => '須恵町',
      ),
      47 => 
      array (
        'id' => '40345',
        'name' => '新宮町',
      ),
      48 => 
      array (
        'id' => '40348',
        'name' => '久山町',
      ),
      49 => 
      array (
        'id' => '40349',
        'name' => '粕屋町',
      ),
      50 => 
      array (
        'id' => '40381',
        'name' => '芦屋町',
      ),
      51 => 
      array (
        'id' => '40382',
        'name' => '水巻町',
      ),
      52 => 
      array (
        'id' => '40383',
        'name' => '岡垣町',
      ),
      53 => 
      array (
        'id' => '40384',
        'name' => '遠賀町',
      ),
      54 => 
      array (
        'id' => '40401',
        'name' => '小竹町',
      ),
      55 => 
      array (
        'id' => '40402',
        'name' => '鞍手町',
      ),
      56 => 
      array (
        'id' => '40421',
        'name' => '桂川町',
      ),
      57 => 
      array (
        'id' => '40447',
        'name' => '筑前町',
      ),
      58 => 
      array (
        'id' => '40448',
        'name' => '東峰村',
      ),
      59 => 
      array (
        'id' => '40503',
        'name' => '大刀洗町',
      ),
      60 => 
      array (
        'id' => '40522',
        'name' => '大木町',
      ),
      61 => 
      array (
        'id' => '40544',
        'name' => '広川町',
      ),
      62 => 
      array (
        'id' => '40601',
        'name' => '香春町',
      ),
      63 => 
      array (
        'id' => '40602',
        'name' => '添田町',
      ),
      64 => 
      array (
        'id' => '40604',
        'name' => '糸田町',
      ),
      65 => 
      array (
        'id' => '40605',
        'name' => '川崎町',
      ),
      66 => 
      array (
        'id' => '40608',
        'name' => '大任町',
      ),
      67 => 
      array (
        'id' => '40609',
        'name' => '赤村',
      ),
      68 => 
      array (
        'id' => '40610',
        'name' => '福智町',
      ),
      69 => 
      array (
        'id' => '40621',
        'name' => '苅田町',
      ),
      70 => 
      array (
        'id' => '40625',
        'name' => 'みやこ町',
      ),
      71 => 
      array (
        'id' => '40642',
        'name' => '吉富町',
      ),
      72 => 
      array (
        'id' => '40646',
        'name' => '上毛町',
      ),
      73 => 
      array (
        'id' => '40647',
        'name' => '築上町',
      ),
    ),
  ),
  40 => 
  array (
    'id' => '41',
    'pref' => '佐賀県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '41201',
        'name' => '佐賀市',
      ),
      1 => 
      array (
        'id' => '41202',
        'name' => '唐津市',
      ),
      2 => 
      array (
        'id' => '41203',
        'name' => '鳥栖市',
      ),
      3 => 
      array (
        'id' => '41204',
        'name' => '多久市',
      ),
      4 => 
      array (
        'id' => '41205',
        'name' => '伊万里市',
      ),
      5 => 
      array (
        'id' => '41206',
        'name' => '武雄市',
      ),
      6 => 
      array (
        'id' => '41207',
        'name' => '鹿島市',
      ),
      7 => 
      array (
        'id' => '41208',
        'name' => '小城市',
      ),
      8 => 
      array (
        'id' => '41209',
        'name' => '嬉野市',
      ),
      9 => 
      array (
        'id' => '41210',
        'name' => '神埼市',
      ),
      10 => 
      array (
        'id' => '41327',
        'name' => '吉野ヶ里町',
      ),
      11 => 
      array (
        'id' => '41341',
        'name' => '基山町',
      ),
      12 => 
      array (
        'id' => '41345',
        'name' => '上峰町',
      ),
      13 => 
      array (
        'id' => '41346',
        'name' => 'みやき町',
      ),
      14 => 
      array (
        'id' => '41387',
        'name' => '玄海町',
      ),
      15 => 
      array (
        'id' => '41401',
        'name' => '有田町',
      ),
      16 => 
      array (
        'id' => '41423',
        'name' => '大町町',
      ),
      17 => 
      array (
        'id' => '41424',
        'name' => '江北町',
      ),
      18 => 
      array (
        'id' => '41425',
        'name' => '白石町',
      ),
      19 => 
      array (
        'id' => '41441',
        'name' => '太良町',
      ),
    ),
  ),
  41 => 
  array (
    'id' => '42',
    'pref' => '長崎県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '42201',
        'name' => '長崎市',
      ),
      1 => 
      array (
        'id' => '42202',
        'name' => '佐世保市',
      ),
      2 => 
      array (
        'id' => '42203',
        'name' => '島原市',
      ),
      3 => 
      array (
        'id' => '42204',
        'name' => '諫早市',
      ),
      4 => 
      array (
        'id' => '42205',
        'name' => '大村市',
      ),
      5 => 
      array (
        'id' => '42207',
        'name' => '平戸市',
      ),
      6 => 
      array (
        'id' => '42208',
        'name' => '松浦市',
      ),
      7 => 
      array (
        'id' => '42209',
        'name' => '対馬市',
      ),
      8 => 
      array (
        'id' => '42210',
        'name' => '壱岐市',
      ),
      9 => 
      array (
        'id' => '42211',
        'name' => '五島市',
      ),
      10 => 
      array (
        'id' => '42212',
        'name' => '西海市',
      ),
      11 => 
      array (
        'id' => '42213',
        'name' => '雲仙市',
      ),
      12 => 
      array (
        'id' => '42214',
        'name' => '南島原市',
      ),
      13 => 
      array (
        'id' => '42307',
        'name' => '長与町',
      ),
      14 => 
      array (
        'id' => '42308',
        'name' => '時津町',
      ),
      15 => 
      array (
        'id' => '42321',
        'name' => '東彼杵町',
      ),
      16 => 
      array (
        'id' => '42322',
        'name' => '川棚町',
      ),
      17 => 
      array (
        'id' => '42323',
        'name' => '波佐見町',
      ),
      18 => 
      array (
        'id' => '42383',
        'name' => '小値賀町',
      ),
      19 => 
      array (
        'id' => '42391',
        'name' => '佐々町',
      ),
      20 => 
      array (
        'id' => '42411',
        'name' => '新上五島町',
      ),
    ),
  ),
  42 => 
  array (
    'id' => '43',
    'pref' => '熊本県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '43100',
        'name' => '熊本市',
      ),
      1 => 
      array (
        'id' => '43101',
        'name' => '中央区',
      ),
      2 => 
      array (
        'id' => '43102',
        'name' => '東区',
      ),
      3 => 
      array (
        'id' => '43103',
        'name' => '西区',
      ),
      4 => 
      array (
        'id' => '43104',
        'name' => '南区',
      ),
      5 => 
      array (
        'id' => '43105',
        'name' => '北区',
      ),
      6 => 
      array (
        'id' => '43202',
        'name' => '八代市',
      ),
      7 => 
      array (
        'id' => '43203',
        'name' => '人吉市',
      ),
      8 => 
      array (
        'id' => '43204',
        'name' => '荒尾市',
      ),
      9 => 
      array (
        'id' => '43205',
        'name' => '水俣市',
      ),
      10 => 
      array (
        'id' => '43206',
        'name' => '玉名市',
      ),
      11 => 
      array (
        'id' => '43208',
        'name' => '山鹿市',
      ),
      12 => 
      array (
        'id' => '43210',
        'name' => '菊池市',
      ),
      13 => 
      array (
        'id' => '43211',
        'name' => '宇土市',
      ),
      14 => 
      array (
        'id' => '43212',
        'name' => '上天草市',
      ),
      15 => 
      array (
        'id' => '43213',
        'name' => '宇城市',
      ),
      16 => 
      array (
        'id' => '43214',
        'name' => '阿蘇市',
      ),
      17 => 
      array (
        'id' => '43215',
        'name' => '天草市',
      ),
      18 => 
      array (
        'id' => '43216',
        'name' => '合志市',
      ),
      19 => 
      array (
        'id' => '43348',
        'name' => '美里町',
      ),
      20 => 
      array (
        'id' => '43364',
        'name' => '玉東町',
      ),
      21 => 
      array (
        'id' => '43367',
        'name' => '南関町',
      ),
      22 => 
      array (
        'id' => '43368',
        'name' => '長洲町',
      ),
      23 => 
      array (
        'id' => '43369',
        'name' => '和水町',
      ),
      24 => 
      array (
        'id' => '43403',
        'name' => '大津町',
      ),
      25 => 
      array (
        'id' => '43404',
        'name' => '菊陽町',
      ),
      26 => 
      array (
        'id' => '43423',
        'name' => '南小国町',
      ),
      27 => 
      array (
        'id' => '43424',
        'name' => '小国町',
      ),
      28 => 
      array (
        'id' => '43425',
        'name' => '産山村',
      ),
      29 => 
      array (
        'id' => '43428',
        'name' => '高森町',
      ),
      30 => 
      array (
        'id' => '43432',
        'name' => '西原村',
      ),
      31 => 
      array (
        'id' => '43433',
        'name' => '南阿蘇村',
      ),
      32 => 
      array (
        'id' => '43441',
        'name' => '御船町',
      ),
      33 => 
      array (
        'id' => '43442',
        'name' => '嘉島町',
      ),
      34 => 
      array (
        'id' => '43443',
        'name' => '益城町',
      ),
      35 => 
      array (
        'id' => '43444',
        'name' => '甲佐町',
      ),
      36 => 
      array (
        'id' => '43447',
        'name' => '山都町',
      ),
      37 => 
      array (
        'id' => '43468',
        'name' => '氷川町',
      ),
      38 => 
      array (
        'id' => '43482',
        'name' => '芦北町',
      ),
      39 => 
      array (
        'id' => '43484',
        'name' => '津奈木町',
      ),
      40 => 
      array (
        'id' => '43501',
        'name' => '錦町',
      ),
      41 => 
      array (
        'id' => '43505',
        'name' => '多良木町',
      ),
      42 => 
      array (
        'id' => '43506',
        'name' => '湯前町',
      ),
      43 => 
      array (
        'id' => '43507',
        'name' => '水上村',
      ),
      44 => 
      array (
        'id' => '43510',
        'name' => '相良村',
      ),
      45 => 
      array (
        'id' => '43511',
        'name' => '五木村',
      ),
      46 => 
      array (
        'id' => '43512',
        'name' => '山江村',
      ),
      47 => 
      array (
        'id' => '43513',
        'name' => '球磨村',
      ),
      48 => 
      array (
        'id' => '43514',
        'name' => 'あさぎり町',
      ),
      49 => 
      array (
        'id' => '43531',
        'name' => '苓北町',
      ),
    ),
  ),
  43 => 
  array (
    'id' => '44',
    'pref' => '大分県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '44201',
        'name' => '大分市',
      ),
      1 => 
      array (
        'id' => '44202',
        'name' => '別府市',
      ),
      2 => 
      array (
        'id' => '44203',
        'name' => '中津市',
      ),
      3 => 
      array (
        'id' => '44204',
        'name' => '日田市',
      ),
      4 => 
      array (
        'id' => '44205',
        'name' => '佐伯市',
      ),
      5 => 
      array (
        'id' => '44206',
        'name' => '臼杵市',
      ),
      6 => 
      array (
        'id' => '44207',
        'name' => '津久見市',
      ),
      7 => 
      array (
        'id' => '44208',
        'name' => '竹田市',
      ),
      8 => 
      array (
        'id' => '44209',
        'name' => '豊後高田市',
      ),
      9 => 
      array (
        'id' => '44210',
        'name' => '杵築市',
      ),
      10 => 
      array (
        'id' => '44211',
        'name' => '宇佐市',
      ),
      11 => 
      array (
        'id' => '44212',
        'name' => '豊後大野市',
      ),
      12 => 
      array (
        'id' => '44213',
        'name' => '由布市',
      ),
      13 => 
      array (
        'id' => '44214',
        'name' => '国東市',
      ),
      14 => 
      array (
        'id' => '44322',
        'name' => '姫島村',
      ),
      15 => 
      array (
        'id' => '44341',
        'name' => '日出町',
      ),
      16 => 
      array (
        'id' => '44461',
        'name' => '九重町',
      ),
      17 => 
      array (
        'id' => '44462',
        'name' => '玖珠町',
      ),
    ),
  ),
  44 => 
  array (
    'id' => '45',
    'pref' => '宮崎県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '45201',
        'name' => '宮崎市',
      ),
      1 => 
      array (
        'id' => '45202',
        'name' => '都城市',
      ),
      2 => 
      array (
        'id' => '45203',
        'name' => '延岡市',
      ),
      3 => 
      array (
        'id' => '45204',
        'name' => '日南市',
      ),
      4 => 
      array (
        'id' => '45205',
        'name' => '小林市',
      ),
      5 => 
      array (
        'id' => '45206',
        'name' => '日向市',
      ),
      6 => 
      array (
        'id' => '45207',
        'name' => '串間市',
      ),
      7 => 
      array (
        'id' => '45208',
        'name' => '西都市',
      ),
      8 => 
      array (
        'id' => '45209',
        'name' => 'えびの市',
      ),
      9 => 
      array (
        'id' => '45341',
        'name' => '三股町',
      ),
      10 => 
      array (
        'id' => '45361',
        'name' => '高原町',
      ),
      11 => 
      array (
        'id' => '45382',
        'name' => '国富町',
      ),
      12 => 
      array (
        'id' => '45383',
        'name' => '綾町',
      ),
      13 => 
      array (
        'id' => '45401',
        'name' => '高鍋町',
      ),
      14 => 
      array (
        'id' => '45402',
        'name' => '新富町',
      ),
      15 => 
      array (
        'id' => '45403',
        'name' => '西米良村',
      ),
      16 => 
      array (
        'id' => '45404',
        'name' => '木城町',
      ),
      17 => 
      array (
        'id' => '45405',
        'name' => '川南町',
      ),
      18 => 
      array (
        'id' => '45406',
        'name' => '都農町',
      ),
      19 => 
      array (
        'id' => '45421',
        'name' => '門川町',
      ),
      20 => 
      array (
        'id' => '45429',
        'name' => '諸塚村',
      ),
      21 => 
      array (
        'id' => '45430',
        'name' => '椎葉村',
      ),
      22 => 
      array (
        'id' => '45431',
        'name' => '美郷町',
      ),
      23 => 
      array (
        'id' => '45441',
        'name' => '高千穂町',
      ),
      24 => 
      array (
        'id' => '45442',
        'name' => '日之影町',
      ),
      25 => 
      array (
        'id' => '45443',
        'name' => '五ヶ瀬町',
      ),
    ),
  ),
  45 => 
  array (
    'id' => '46',
    'pref' => '鹿児島県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '46201',
        'name' => '鹿児島市',
      ),
      1 => 
      array (
        'id' => '46203',
        'name' => '鹿屋市',
      ),
      2 => 
      array (
        'id' => '46204',
        'name' => '枕崎市',
      ),
      3 => 
      array (
        'id' => '46206',
        'name' => '阿久根市',
      ),
      4 => 
      array (
        'id' => '46208',
        'name' => '出水市',
      ),
      5 => 
      array (
        'id' => '46210',
        'name' => '指宿市',
      ),
      6 => 
      array (
        'id' => '46213',
        'name' => '西之表市',
      ),
      7 => 
      array (
        'id' => '46214',
        'name' => '垂水市',
      ),
      8 => 
      array (
        'id' => '46215',
        'name' => '薩摩川内市',
      ),
      9 => 
      array (
        'id' => '46216',
        'name' => '日置市',
      ),
      10 => 
      array (
        'id' => '46217',
        'name' => '曽於市',
      ),
      11 => 
      array (
        'id' => '46218',
        'name' => '霧島市',
      ),
      12 => 
      array (
        'id' => '46219',
        'name' => 'いちき串木野市',
      ),
      13 => 
      array (
        'id' => '46220',
        'name' => '南さつま市',
      ),
      14 => 
      array (
        'id' => '46221',
        'name' => '志布志市',
      ),
      15 => 
      array (
        'id' => '46222',
        'name' => '奄美市',
      ),
      16 => 
      array (
        'id' => '46223',
        'name' => '南九州市',
      ),
      17 => 
      array (
        'id' => '46224',
        'name' => '伊佐市',
      ),
      18 => 
      array (
        'id' => '46225',
        'name' => '姶良市',
      ),
      19 => 
      array (
        'id' => '46303',
        'name' => '三島村',
      ),
      20 => 
      array (
        'id' => '46304',
        'name' => '十島村',
      ),
      21 => 
      array (
        'id' => '46392',
        'name' => 'さつま町',
      ),
      22 => 
      array (
        'id' => '46404',
        'name' => '長島町',
      ),
      23 => 
      array (
        'id' => '46452',
        'name' => '湧水町',
      ),
      24 => 
      array (
        'id' => '46468',
        'name' => '大崎町',
      ),
      25 => 
      array (
        'id' => '46482',
        'name' => '東串良町',
      ),
      26 => 
      array (
        'id' => '46490',
        'name' => '錦江町',
      ),
      27 => 
      array (
        'id' => '46491',
        'name' => '南大隅町',
      ),
      28 => 
      array (
        'id' => '46492',
        'name' => '肝付町',
      ),
      29 => 
      array (
        'id' => '46501',
        'name' => '中種子町',
      ),
      30 => 
      array (
        'id' => '46502',
        'name' => '南種子町',
      ),
      31 => 
      array (
        'id' => '46505',
        'name' => '屋久島町',
      ),
      32 => 
      array (
        'id' => '46523',
        'name' => '大和村',
      ),
      33 => 
      array (
        'id' => '46524',
        'name' => '宇検村',
      ),
      34 => 
      array (
        'id' => '46525',
        'name' => '瀬戸内町',
      ),
      35 => 
      array (
        'id' => '46527',
        'name' => '龍郷町',
      ),
      36 => 
      array (
        'id' => '46529',
        'name' => '喜界町',
      ),
      37 => 
      array (
        'id' => '46530',
        'name' => '徳之島町',
      ),
      38 => 
      array (
        'id' => '46531',
        'name' => '天城町',
      ),
      39 => 
      array (
        'id' => '46532',
        'name' => '伊仙町',
      ),
      40 => 
      array (
        'id' => '46533',
        'name' => '和泊町',
      ),
      41 => 
      array (
        'id' => '46534',
        'name' => '知名町',
      ),
      42 => 
      array (
        'id' => '46535',
        'name' => '与論町',
      ),
    ),
  ),
  46 => 
  array (
    'id' => '47',
    'pref' => '沖縄県',
    'city' => 
    array (
      0 => 
      array (
        'id' => '47201',
        'name' => '那覇市',
      ),
      1 => 
      array (
        'id' => '47205',
        'name' => '宜野湾市',
      ),
      2 => 
      array (
        'id' => '47207',
        'name' => '石垣市',
      ),
      3 => 
      array (
        'id' => '47208',
        'name' => '浦添市',
      ),
      4 => 
      array (
        'id' => '47209',
        'name' => '名護市',
      ),
      5 => 
      array (
        'id' => '47210',
        'name' => '糸満市',
      ),
      6 => 
      array (
        'id' => '47211',
        'name' => '沖縄市',
      ),
      7 => 
      array (
        'id' => '47212',
        'name' => '豊見城市',
      ),
      8 => 
      array (
        'id' => '47213',
        'name' => 'うるま市',
      ),
      9 => 
      array (
        'id' => '47214',
        'name' => '宮古島市',
      ),
      10 => 
      array (
        'id' => '47215',
        'name' => '南城市',
      ),
      11 => 
      array (
        'id' => '47301',
        'name' => '国頭村',
      ),
      12 => 
      array (
        'id' => '47302',
        'name' => '大宜味村',
      ),
      13 => 
      array (
        'id' => '47303',
        'name' => '東村',
      ),
      14 => 
      array (
        'id' => '47306',
        'name' => '今帰仁村',
      ),
      15 => 
      array (
        'id' => '47308',
        'name' => '本部町',
      ),
      16 => 
      array (
        'id' => '47311',
        'name' => '恩納村',
      ),
      17 => 
      array (
        'id' => '47313',
        'name' => '宜野座村',
      ),
      18 => 
      array (
        'id' => '47314',
        'name' => '金武町',
      ),
      19 => 
      array (
        'id' => '47315',
        'name' => '伊江村',
      ),
      20 => 
      array (
        'id' => '47324',
        'name' => '読谷村',
      ),
      21 => 
      array (
        'id' => '47325',
        'name' => '嘉手納町',
      ),
      22 => 
      array (
        'id' => '47326',
        'name' => '北谷町',
      ),
      23 => 
      array (
        'id' => '47327',
        'name' => '北中城村',
      ),
      24 => 
      array (
        'id' => '47328',
        'name' => '中城村',
      ),
      25 => 
      array (
        'id' => '47329',
        'name' => '西原町',
      ),
      26 => 
      array (
        'id' => '47348',
        'name' => '与那原町',
      ),
      27 => 
      array (
        'id' => '47350',
        'name' => '南風原町',
      ),
      28 => 
      array (
        'id' => '47353',
        'name' => '渡嘉敷村',
      ),
      29 => 
      array (
        'id' => '47354',
        'name' => '座間味村',
      ),
      30 => 
      array (
        'id' => '47355',
        'name' => '粟国村',
      ),
      31 => 
      array (
        'id' => '47356',
        'name' => '渡名喜村',
      ),
      32 => 
      array (
        'id' => '47357',
        'name' => '南大東村',
      ),
      33 => 
      array (
        'id' => '47358',
        'name' => '北大東村',
      ),
      34 => 
      array (
        'id' => '47359',
        'name' => '伊平屋村',
      ),
      35 => 
      array (
        'id' => '47360',
        'name' => '伊是名村',
      ),
      36 => 
      array (
        'id' => '47361',
        'name' => '久米島町',
      ),
      37 => 
      array (
        'id' => '47362',
        'name' => '八重瀬町',
      ),
      38 => 
      array (
        'id' => '47375',
        'name' => '多良間村',
      ),
      39 => 
      array (
        'id' => '47381',
        'name' => '竹富町',
      ),
      40 => 
      array (
        'id' => '47382',
        'name' => '与那国町',
      ),
    ),
  ),
);
if(isset($_REQUEST['to']) && $_REQUEST['to'] == 'shop'){
	if(isset($_REQUEST['ajax']) && $_REQUEST['ajax'] == 'ajax'){
		if(!isset($_REQUEST['search'])){
			echo 'no';
			exit;
		}
		$posts = $wpdb->get_results("SELECT * FROM wp_ms_shop where shop_name like '%".$_REQUEST['search']."%' order by `time` desc limit 0, 20");
		echo json_encode($posts);
		exit;
	}
}
if(isset($_REQUEST['to']) && $_REQUEST['to'] == 'client'){
	if(isset($_REQUEST['ajax']) && $_REQUEST['ajax'] == 'ajax'){
		if(!isset($_REQUEST['search']) && !isset($_REQUEST['shop'])){
			echo 'no';
			exit;
		}
		$where = array();
		$format=array();
		if(isset($_REQUEST['search'])){
			array_push($where, "address like '%".$_REQUEST['search']."%'");
		}
		if(isset($_REQUEST['shop']) && $_REQUEST['shop'] != ''){
			array_push($where, 'shop = %s');
			array_push($format, $_REQUEST['shop']);
		}
		$wherestr = implode(' and ', $where);
		$posts = $wpdb->get_results($wpdb->prepare("SELECT * FROM wp_ms_client where ".$wherestr." order by `time` desc limit 0, 20", $format ));
		echo json_encode($posts);
		exit;
	}
}
if(isset($_REQUEST['to']) && $_REQUEST['to'] == 'client_codes'){
    if(isset($_REQUEST['ajax']) && $_REQUEST['ajax'] == 'ajax'){
        $wherestr = "";
        if(isset($_REQUEST['search'])){
            $wherestr = "client_code like '%".$_REQUEST['search']."%'";
        }
        // $wherestr = implode(' and ', $where);
        $clients = $wpdb->get_results("SELECT * FROM wp_ms_client where ".$wherestr." order by `time` desc");
        $a = array();
        if(count($clients) > 0){
            foreach($clients as $client){
                array_push($a, array('id'=>$client->id, 
                                    'label'=>$client->client_code, 
                                    'value'=>$client->client_code, 
                                    'name'=>$client->name, 
                                    'shop'=>$client->shop_id, 
                                    'address'=>!empty($client->shipping_info) ? $client->shipping_info : $client->client_pref.'   '.$client->client_city.'  '.$client->address
                                ));
            }
        }
        echo json_encode($a);
        exit;
    }
}
if(isset($_REQUEST['to']) && $_REQUEST['to'] == 'clients'){
	if(isset($_REQUEST['ajax']) && $_REQUEST['ajax'] == 'ajax'){
		$wherestr = "";
		if(isset($_REQUEST['search'])){
			$wherestr = "name like '%".$_REQUEST['search']."%'";
		}
		// $wherestr = implode(' and ', $where);
		$clients = $wpdb->get_results("SELECT * FROM wp_ms_client where ".$wherestr." order by `time` desc");
		$a = array();
		if(count($clients) > 0){
			foreach($clients as $client){
				array_push($a, array('id'=>$client->id, 
									'label'=>$client->name, 
									'value'=>$client->name, 
									'shop'=>$client->shop_id, 
                                    'client_code'=>$client->client_code, 
									'address'=>!empty($client->shipping_info) ? $client->shipping_info : $client->client_pref.'   '.$client->client_city.'  '.$client->address
								));
			}
		}
		echo json_encode($a);
		exit;
	}
}
if(isset($_REQUEST['to']) && $_REQUEST['to'] == 'products'){
	if(isset($_REQUEST['ajax']) && $_REQUEST['ajax'] == 'ajax'){
		if(!isset($_REQUEST['search']) && !isset($_REQUEST['shop'])){
			echo 'no';
			exit;
		}
		$where = array();
		$format=array();
		// if(isset($_REQUEST['search'])){
		// 	array_push($where, "name like '%".$_REQUEST['search']."%'");
		// }
		if(isset($_REQUEST['shop']) && $_REQUEST['shop'] != ''){
			array_push($where, 'shop_id = %d');
			array_push($format, $_REQUEST['shop']);
		}
		$wherestr = implode(' and ', $where);
		$posts = $wpdb->get_results($wpdb->prepare("SELECT * FROM wp_ms_products where ".$wherestr." order by `time` desc ", $format ));
		echo json_encode($posts);
		// print_r($posts);
		exit;
	}
}
if(isset($_REQUEST['to']) && $_REQUEST['to'] == 'product'){
	if(isset($_REQUEST['ajax']) && $_REQUEST['ajax'] == 'ajax'){
		if(!isset($_REQUEST['search']) && !isset($_REQUEST['shop'])){
			echo 'no';
			exit;
		}
		$where = array();
		$format=array();
		if(isset($_REQUEST['search'])){
			array_push($where, "name like '%".$_REQUEST['search']."%'");
		}
		if(isset($_REQUEST['shop']) && $_REQUEST['shop'] != ''){
			array_push($where, 'shop = %s');
			array_push($format, $_REQUEST['shop']);
		}
		$wherestr = implode(' and ', $where);
		$posts = $wpdb->get_results($wpdb->prepare("SELECT * FROM wp_ms_products where ".$wherestr." order by `time` desc limit 0, 20", $format ));
		echo json_encode($posts);
		// print_r($posts);
		exit;
	}
}
if(isset($_REQUEST['page']) && $_REQUEST['page'] == 'product'){
	$where = array();
	$format=array();
	if(isset($_REQUEST['search'])){
		array_push($where, "name like '%".$_REQUEST['search']."%'");
	}
	if(isset($_REQUEST['shop']) && $_REQUEST['shop'] != ''){
		array_push($where, 'shop = %s');
		array_push($format, $_REQUEST['shop']);
	}
	$wherestr = implode(' and ', $where);
	$row = $_REQUEST['row'];
	$rowperpage = 20;
	array_push($format, $row);
	array_push($format, $rowperpage);
	$posts = $wpdb->get_results($wpdb->prepare("SELECT * FROM wp_ms_products where ".$wherestr." order by `time` desc limit %d, %d", $format ));
	// $posts = $wpdb->get_results("SELECT * FROM wp_ms_client order by `time` desc limit ".$row.", ".$rowperpage);
	echo json_encode($posts);
	exit;
}
if(isset($_REQUEST['page']) && $_REQUEST['page'] == 'client'){
	$where = array();
	$format=array();
	if(isset($_REQUEST['search'])){
		array_push($where, "address like '%".$_REQUEST['search']."%'");
	}
	if(isset($_REQUEST['shop']) && $_REQUEST['shop'] != ''){
		array_push($where, 'shop = %s');
		array_push($format, $_REQUEST['shop']);
	}
	$wherestr = implode(' and ', $where);
	$row = $_REQUEST['row'];
	$rowperpage = 20;
	array_push($format, $row);
	array_push($format, $rowperpage);
	$posts = $wpdb->get_results($wpdb->prepare("SELECT * FROM wp_ms_client where ".$wherestr." order by `time` desc limit %d, %d", $format ));
	// $posts = $wpdb->get_results("SELECT * FROM wp_ms_client order by `time` desc limit ".$row.", ".$rowperpage);
	echo json_encode($posts);
	exit;
}
if(isset($_REQUEST['page']) && $_REQUEST['page'] == 'shop'){
	$row = $_REQUEST['row'];
	$rowperpage = 20;
	$posts = $wpdb->get_results($wpdb->prepare("SELECT * FROM wp_ms_shop where shop_name like '%".$_REQUEST['search']."%' order by `time` desc limit %d, %d", array($row, $rowperpage) ));
	// $posts = $wpdb->get_results("SELECT * FROM wp_ms_client order by `time` desc limit ".$row.", ".$rowperpage);
	echo json_encode($posts);
	exit;
}

if(isset($_REQUEST['to']) && $_REQUEST['to'] == "save_product"){
    // if(isset('fromClient') && $_REQUEST['fromClient'] == 1){

    // }
	$wpdb->query( "START TRANSACTION" );
	$table = $wpdb->prefix.'ms_invoice_history';

	$history_id = uniqid();
	$t = date("Y-m-d H:i:s");

	$history['history_id'] = $history_id;
	$history['invoice_date'] = $_REQUEST['shop'][0]['invoice_date'];
    $invoices = $wpdb->get_results("SELECT max(invoice_num) as invoice_num FROM wp_ms_invoice");
    $invoice_num = 1 + (int)$invoices[0]->invoice_num;
	$history['invoice_num'] = $invoice_num;
	//
	$ary_client = array();
	$ary_client_id = array();
    $ary_client_code = array();
	$ary_product = array();
	$ary_product_id = array();
	$b_shop = "";
	$p_shop = "";
	for($i = 0; $i < count($_REQUEST['shop']); $i++){	
		if($b_shop != $_REQUEST['shop'][$i]['client_id']){
			array_push($ary_client, $_REQUEST['shop'][$i]['client']);
			array_push($ary_client_id, $_REQUEST['shop'][$i]['client_id']);
            array_push($ary_client_code, $_REQUEST['shop'][$i]['client_code']);
			$b_shop = $_REQUEST['shop'][$i]['client_id'];
		}
		if($p_shop != $_REQUEST['shop'][$i]['sel_product_id']){
			array_push($ary_product, $_REQUEST['shop'][$i]['product_list']);
			array_push($ary_product_id, $_REQUEST['shop'][$i]['sel_product_id']);
			$p_shop = $_REQUEST['shop'][$i]['sel_product_id'];
		}
	}
	// $ary_product = array();
	// for($i = 0; $i < count($_REQUEST['shop']); $i++){	
	// 	if($b_shop != $_REQUEST['shop'][$i]['product_list']){
	// 		array_push($ary_product, $_REQUEST['shop'][$i]['product_list']);
	// 		$b_shop = $_REQUEST['shop'][$i]['product_list'];
	// 	}
	// }
	$history['client'] = implode(',', $ary_client);
	$history['client_id'] = implode(',', $ary_client_id);
    $history['client_code'] = implode(',', $ary_client_code);
	$history['products'] = implode(',', $ary_product);
	$history['products_id'] = implode(',', $ary_product_id);
    $history['state'] = "納品中";
    if(isset($_REQUEST['fromClient']) && $_REQUEST['fromClient'] == 1){
	   $history['state'] = "請求中";
    }
	$history['time'] = $t;

	$clients = $wpdb->get_results($wpdb->prepare("SELECT * FROM wp_ms_client where id = %d", $ary_client_id[0]));
	$client =$clients[0];
    $shops = $wpdb->get_results($wpdb->prepare("SELECT * FROM wp_ms_shop where id = %d", $client->shop_id));
    $_shop =$shops[0];

    // var_export($history);
	$result = $wpdb->insert($table, $history);

	//if($_REQUEST['action'] == 'createuser'){
	$table = $wpdb->prefix.'ms_invoice';
	for($i = 0; $i < count($_REQUEST['shop']); $i++){
		
		$shop = $_REQUEST['shop'][$i];

		$shop['time'] = $t;
		$shop['history_id'] = $history_id;	
        $shop['invoice_num'] = $invoice_num;

		$result = $wpdb->insert($table, $shop);
		$my_id = $wpdb->insert_id;
	}
	$wpdb->query( "COMMIT" );

  if(isset($_REQUEST['fromClient']) && $_REQUEST['fromClient'] == 1){
      echo 'ok';
      exit;
  }
  
  $client_mail = $client->mail;
  $subject = '【KINUJO】ご注文誠にありがとうございます。';
  
  $content = include "email-template.php";

  // echo $content;
  $headers = array();
  $headers[] = 'Content-Type: text/html; charset=UTF-8';
  $headers[] = "From: ".$_shop->shop_name." <".$_shop->mail.">";
  //$headers[] = 'From: '.$_shop->shop_name.' <'.$_shop->mail.'>';
  //$headers[] = 'Cc: John Q Codex <jqc@wordpress.org>';
  
  // var_export($headers);

  wp_mail('moonrider.crowdworks@gmail.com', $subject, $content, $headers);
	// //echo "Ok";

  // $to = 'moon.rider.dev@gmail.com';
  // $subject = 'The subject';
  // $body = 'The email body content';
  // $headers = array('Content-Type: text/html; charset=UTF-8');
  
  //wp_mail( $to, $subject, $body, $headers );


	echo 'ok11';
	exit;
} 
if(isset($_REQUEST['to']) && $_REQUEST['to'] == 'details'){
	if(!isset($_REQUEST['id'])){
		echo 'no';
		exit;
	}
	$details = $wpdb->get_results($wpdb->prepare("SELECT * FROM wp_ms_invoice where history_id = %s order by `id`", array($_REQUEST['id'])));
	echo json_encode($details);
	exit;
}
if(isset($_REQUEST['to']) && $_REQUEST['to'] == 'pref'){
	$html = "<option value=''>都道府県を選択</option>";
	for($i = 0; $i < count($pref_city); $i++){
		$html .= "<option value='".$pref_city[$i]["pref"]."'>".$pref_city[$i]["pref"]."</option>";
	}
	echo $html;
	exit;
}
if(isset($_REQUEST['to']) && $_REQUEST['to'] == 'city'){

	$html = "<option value=''>市区町村を選択</option>";
	for($i = 0; $i < count($pref_city); $i++){
		if($pref_city[$i]['pref'] == $_REQUEST['pref']){
			
			for($j = 0; $j < count($pref_city[$i]["city"]); $j++){
				$html .= "<option value='".$pref_city[$i]["city"][$j]['name']."'>".$pref_city[$i]["city"][$j]['name']."</option>";
			}
		}
	}
	
	echo $html;
	exit;
}
if(isset($_REQUEST['to']) && $_REQUEST['to'] == 'history'){
	
	$where = "";
	$format = array();
	$invoice_date = " 1 ";
	$client = " 1 ";
	$product = " 1 ";
	if(isset($_REQUEST['invoice_date']) && !empty($_REQUEST['invoice_date']) && $_REQUEST['invoice_date'] != ''){
		if(empty($_REQUEST['invoice_date1']) && $_REQUEST['invoice_date1'] == ''){
			$invoice_date = " invoice_date >= %s";
			array_push($format, $_REQUEST['invoice_date']);
		}else{
			$invoice_date = " invoice_date between %s and %s";
			array_push($format, $_REQUEST['invoice_date']);
			array_push($format, $_REQUEST['invoice_date1']);
		}
	}else{
		if(empty($_REQUEST['invoice_date1']) && $_REQUEST['invoice_date1'] == ''){
		}else{
			$invoice_date = " invoice_date <= %s";
			array_push($format, $_REQUEST['invoice_date1']);
		}
	}

	if(isset($_REQUEST['client']) && !empty($_REQUEST['client']) && $_REQUEST['client'] != ''){
		$client = ' FIND_IN_SET("%s", client_id) ';
		array_push($format, $_REQUEST['client']);
	}

	if(isset($_REQUEST['product']) && !empty($_REQUEST['product']) && $_REQUEST['product'] != ''){
		$product = ' FIND_IN_SET("%s", products_id) ';
		array_push($format, $_REQUEST['product']);
	}
	$where = $invoice_date.' and '.$client.' and '.$product;
	// echo $where;
	// var_export($format);
	$details = $wpdb->get_results($wpdb->prepare("SELECT * FROM wp_ms_invoice_history where $where  order by `invoice_date` desc", $format));
	echo json_encode($details);
	exit;
}
if(isset($_REQUEST['to']) && $_REQUEST['to'] == 'delivery'){
    $history_id = $_REQUEST['invoice'];
    // $result = $wpdb->update('wp_ms_invoice', array('delivery_date'=>date('Y-m-d H:i')), array('history_id'=>$history_id), array('%s'), array('%s'));
    $result1 = $wpdb->update('wp_ms_invoice_history', array('state'=>'納品中'), array('history_id'=>$history_id), array('%s'), array('%s'));

    $invoices = $wpdb->get_results($wpdb->prepare("SELECT * FROM wp_ms_invoice_history where history_id = %s", $history_id));
    $invoice = $invoices[0];

    $clients = $wpdb->get_results($wpdb->prepare("SELECT * FROM wp_ms_client where id = %d", $invoice->client_id));
    $client = $clients[0];

    $shops = $wpdb->get_results($wpdb->prepare("SELECT * FROM wp_ms_shop where id = %d", $client->shop_id));
    $_shop =$shops[0];
    
    if($result1){
        $client_mail = $client->mail;
        $subject = '【KINUJO】ご注文誠にありがとうございます。';
        
        $content = include "email-template.php";

        // echo $content;
        $headers = array('Content-Type: text/html; charset=UTF-8');
        array_push($headers, 'From: '.$_shop->shop_name.' <dddd>');
        // $headers[] = 'From: '.$_shop->shop_name.' <'.$_shop->mail.'>';
        //$headers[] = 'Cc: John Q Codex <jqc@wordpress.org>';
        // var_export($_shop->mail);
        // echo $content;
        // var_export($client_mail);
        // var_export($headers);
        wp_mail($client_mail, $subject, $content, $headers);
        echo 'ok';
    }
    exit;
}
if(isset($_REQUEST['to']) && $_REQUEST['to'] == 'confirm'){
    $history_id = $_REQUEST['invoice'];
    $result = $wpdb->update('wp_ms_invoice', array('delivery_date'=>date('Y-m-d H:i')), array('history_id'=>$history_id), array('%s'), array('%s'));
    $result1 = $wpdb->update('wp_ms_invoice_history', array('state'=>'完了'), array('history_id'=>$history_id), array('%s'), array('%s'));
    echo 'ok';
    exit;
}
echo 'no';
?>